{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":121546690,"authorName":"Noid.EXE","from":"&quot;Noid.EXE&quot; &lt;lorea85@...&gt;","profile":"noidmh","replyTo":"LIST","senderId":"WWcB-qzRcQ6NvtNc_Pnccz9u43iYMy2UoO_n91QRfJH-t26oOQNYo3WPYGEzIRGgRwPWA5vlDiB5PwfscI_0_By_hc-bBMcJqSGh","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Evolution Will Be Mechanized","postDate":"1095035692","msgId":11335,"canDelete":true,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG9wc2Q4bzhla3VoZzk3cXZAMjAxLTI1NC0yNDktNTcubXJzZS5jb20uYXI+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":11334,"nextInTime":11336,"topicId":11335,"numMessagesInTopic":1,"msgSnippet":"Lo saque de Wired, que opinan del tema? ... The Evolution Will Be Mechanized Inside the unfathomable superhuman future after the singularity. The rate of","rawEmail":"Return-Path: &lt;lorea85@...&gt;\r\nX-Sender: lorea85@...\r\nX-Apparently-To: JuegosAR@...\r\nReceived: (qmail 39890 invoked from network); 13 Sep 2004 00:34:30 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m18.grp.scd.yahoo.com with QMQP; 13 Sep 2004 00:34:30 -0000\r\nReceived: from unknown (HELO postinofz1.prima.com.ar) (200.42.0.149)\n  by mta1.grp.scd.yahoo.com with SMTP; 13 Sep 2004 00:34:28 -0000\r\nReceived: (qmail 64867 invoked from network); 13 Sep 2004 00:34:25 -0000\r\nReceived: from unknown (HELO 201-254-249-57.mrse.com.ar) (201.254.249.57)\n  by postinofz1.prima.com.ar with SMTP; 13 Sep 2004 00:34:25 -0000\r\nTo: ADVA &lt;JuegosAR@...&gt;\r\nDate: Sun, 12 Sep 2004 21:34:52 -0300\r\nContent-Type: text/plain; format=flowed; delsp=yes; charset=utf-8\r\nMIME-Version: 1.0\r\nContent-Transfer-Encoding: 8bit\r\nMessage-ID: &lt;opsd8o8ekuhg97qv@...&gt;\r\nUser-Agent: Opera M2/7.51 (Win32, build 3798)\r\nX-eGroups-Remote-IP: 200.42.0.149\r\nFrom: &quot;Noid.EXE&quot; &lt;lorea85@...&gt;\r\nSubject: The Evolution Will Be Mechanized\r\nX-Yahoo-Group-Post: member; u=121546690\r\nX-Yahoo-Profile: noidmh\r\n\r\nLo saque de Wired, que opinan del tema?\n\n-------------------------------\nThe Evolution Will Be Mechanized\nInside the unfathomable superhuman future after the &quot;singularity.&quot;\n\nThe rate of technological change is dizzying, and it&#39;s only getting  \nfaster. In September at Stanford, the Institute for the Study of  \nAccelerating Change is acknowledging the trend with its second annual  \nAccelerating Change conference. The 2003 confab was billed as &quot;the first  \nin the world to focus on the multidisciplinary implications of  \naccelerating change and the multidisciplinary implications of accelerating  \nchange and the consequences of a technological singularity.&quot; What is a  \ntechnological singularity? A moment when runaway ad-vances outstrip human  \ncomprehension and all our knowledge and experience becomes useless as a  \nguidepost to the future.\n\nFuturists find it hard to resist this radically changed superhuman future,  \nthough futurists are, in point of fact, human. Our IQs aren&#39;t high enough  \nto boil water. Our brains aren&#39;t supercharged with nifty silicon memory  \nchips. Our organs aren&#39;t continually rejuvenated by blood-borne  \nnanomachines. Such shattering break-throughs seem more or less plausible,  \nbut they&#39;re so mind-boggling that we can&#39;t say anything useful about the  \neffect they&#39;re likely to have.\n\nScience fiction writer Vernor Vinge popularized the term singularity in  \nthe early &#39;90s. For about a decade, it threw a wrench in the gears of  \nscience fiction as an intellectual effort. It&#39;s hard to fantasize about  \ntomorrow when you&#39;re firmly convinced that tomorrow is inherently  \nunfantasizable. However, sneaky sci-fi authors have been able to finesse  \nthe problem. After all, the genre doesn&#39;t exist to forecast the future;  \nit&#39;s entertainment that depends on making the impossible seem plausible. A  \nsingularity turns out to be a great way to do that. It may be unthinkable  \nand indescribable - but the wreckage it leaves isn&#39;t. After a singularity  \nblows through, the world might as well be Oz, complete with talking  \nscarecrows and tin men.\n\nMovie fans can see this imaginary wall across the future in flicks like  \nTerminator and The Matrix, where a dystopian technological event allows  \nsmart machines to take over. The superintelligent gizmos turn out to be  \nfairly standard serial-killer bogeymen - although they wear cool gear,  \nperform feats of biblical wonder, and become governor of California.\n\nA singularity looks great in special f/x, but is there any substance in  \nthe idea? When Vinge first posed the problem, he was concerned that the  \nimminent eruption in artificial intelligence would lead to übermenschen of  \nunfathomable mental agility. More than a decade later, we still can&#39;t say  \nwith any precision what intelligence is, much less how to build it. If you  \nfail to define your terms, it is easy to divide by zero and predict  \ninfinite exponential evolution. Sure, computers might someday awaken into  \nsomething resembling human consciousness, but we have no metrics to  \ndescribe that awakening and thus no objective way to recognize it if it  \nhappens. How would you test a claim like that?\n\nEven if machines remain inert and dumb, we still might provoke a  \nsingularity by giving humans a superboost. This notion is catnip for the  \ntechno-intelligentsia: &quot;Wow, if we brainy geeks were even more like we  \nalready are, we&#39;d be godlike!&quot; Check out the biographies of real-life  \ngeniuses, though - Newton, Goethe, da Vinci, Einstein - and you find  \nvulnerable mortals who have difficulty maintaining focus. If the world  \nwere full of da Vincis, we&#39;d all be quarrelsome, gay, left-handed Italians  \nwho couldn&#39;t finish a painting.\n\nVinge put it this way: &quot;For me, the superhumanity is the essence of the  \nSingularity. Without that, we would get a glut of tech-nical riches, never  \nproperly absorbed.&quot; Remove the magic threat of artificial intelligence  \n from Vinge&#39;s prognostication, and you get a brilliant description of the  \npresent day: a glut of technical riches, never properly absorbed. Instead  \nof spiritual supercomputers for brains, we&#39;ve got a spam-choked Internet.\n\nThe singularity&#39;s biggest flaw isn&#39;t that it&#39;s hard to imagine, but that  \nit flatters its human inventors. We may be on the verge of an astounding  \nbreakthrough! Or, with equal likelihood, we may be at the edge of a new  \ndark age of plagues, mass hunger, and climate destabilization. More likely  \nyet, we live in a dull, self-satisfied, squalid eddy in history,  \nblundering around with no concept of progress and no sense of direction.  \nWe have no idea what we really want from our own lives or from society.  \nAnd no Moore&#39;s law rising majestically on any 2-D graph is ever going make  \nus magnificent or spiritual when we lack the will, vision, and appetite  \nfor spiritual magnificence.\n\nIs that prospect so hard to get our heads around? Well, yeah - maybe it is.\nEmail Bruce Sterling at bruces@....\n\n-- \nノイド・エグゼ\nNoid.EXE\n\n"}}