{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":121546690,"authorName":"Noid.EXE","from":"&quot;Noid.EXE&quot; &lt;lorea85@...&gt;","profile":"noidmh","replyTo":"LIST","senderId":"CT65AIHDV2-wjRouUaft4gjP6I47Q4DxssAyAkWmebKP0tkoHVfK2lGWIzqalC3YKAG0L7MY6_MWuenUO4HPtxo3PD8aWpTeWoAx","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [JuegosAr] Guion en los juegos / Viaje en el tiempo en guiones.","postDate":"1098579329","msgId":11842,"canDelete":true,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG9wc2djbmlyZmFoZzk3cXZAbG9jYWxob3N0Pg==","inReplyToHeader":"PDEwOTc1NTQxNDcuMzUxOS40NS5jYW1lbEByZWRib3gubmV0Ym94ZXM+","referencesHeader":"PEJBWTgtRjM1cEwzMmN0RmZqOFowMDAyMjMzMUBob3RtYWlsLmNvbT4gPDEwOTc1NTQxNDcuMzUxOS40NS5jYW1lbEByZWRib3gubmV0Ym94ZXM+"},"prevInTopic":11691,"nextInTopic":11878,"prevInTime":11841,"nextInTime":11843,"topicId":11594,"numMessagesInTopic":28,"msgSnippet":"La idea esta buena, aunque me parece casi lo mismo que la de los universos paralelos casi identicos. Lo que no me quedo claro es porqué la particula salta de","rawEmail":"Return-Path: &lt;lorea85@...&gt;\r\nX-Sender: lorea85@...\r\nX-Apparently-To: JuegosAR@...\r\nReceived: (qmail 84109 invoked from network); 24 Oct 2004 00:55:02 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m18.grp.scd.yahoo.com with QMQP; 24 Oct 2004 00:55:02 -0000\r\nReceived: from unknown (HELO postinofz1.prima.com.ar) (200.42.0.149)\n  by mta1.grp.scd.yahoo.com with SMTP; 24 Oct 2004 00:55:02 -0000\r\nReceived: (qmail 48448 invoked from network); 24 Oct 2004 00:54:58 -0000\r\nReceived: from unknown (HELO localhost) (201.254.251.53)\n  by postinofz1.prima.com.ar with SMTP; 24 Oct 2004 00:54:58 -0000\r\nDate: Sat, 23 Oct 2004 21:55:29 -0300\r\nTo: JuegosAR@...\r\nReferences: &lt;BAY8-F35pL32ctFfj8Z00022331@...&gt; &lt;1097554147.3519.45.camel@...&gt;\r\nMessage-ID: &lt;opsgcnirfahg97qv@localhost&gt;\r\nIn-Reply-To: &lt;1097554147.3519.45.camel@...&gt;\r\nUser-Agent: Opera M2/7.51 (Win32, build 3798)\r\nContent-Type: text/plain; format=flowed; delsp=yes; charset=utf-8\r\nMIME-Version: 1.0\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Remote-IP: 200.42.0.149\r\nFrom: &quot;Noid.EXE&quot; &lt;lorea85@...&gt;\r\nSubject: Re: [JuegosAr] Guion en los juegos / Viaje en el tiempo en guiones.\r\nX-Yahoo-Group-Post: member; u=121546690\r\nX-Yahoo-Profile: noidmh\r\n\r\nLa idea esta buena, aunque me parece casi lo mismo que la de los universos  \nparalelos casi identicos. Lo que no me quedo claro es porqué la particula  \nsalta de un universo Mn a uno Mn+1. Y si viaja al futuro? no seria  \nnecesario cambiar de meta-tiempo, simplemente desapareceria y apareceria  \nmas tarde. (que bueno que ahora podemos hacer OT tranquilos)\n-----\nNoid.\n\nPD: y si el tiempo va en reversa?\n\nOn Tue, 12 Oct 2004 03:42:29 -0300, H. Hernan Moraldo  \n&lt;hernan@...&gt; wrote:\n\n&gt;\n&gt;&gt; Sobre fisica cuantica y agujeros de gusano, fui precisamente a\n&gt;&gt; hablarle a un amigo fisico canadiense precisamente al respecto, y me\n&gt;&gt; dijo que en su circulo de fisicos se discutio ese tema muchas veces,\n&gt;&gt; nunca llegando a una conclusion. El opino lo mismo que nosotros..vas\n&gt;&gt; al pasado, matas a tu viejos y seguis con el cuchillo en la mano, y\n&gt;&gt; ahi estas y nada mas.\n&gt;&gt;\n&gt;&gt; Corregime si no entendi bien, pero decis algo como que si viajas al\n&gt;&gt; pasado, en realidad viajas a un mundo paralelo identico (excepto por\n&gt;&gt; tu nueva presencia). Parece &quot;cerrar&quot; en ciertos sentidos, pero eso no\n&gt;&gt; significaria que se puede viajar a ese universo paralelo donde pedro\n&gt;&gt; 35 se fue a otro universo?.\n&gt;&gt;\n&gt;&gt; Con ese sistema, parece que se viaja entre universos, y no atraves del\n&gt;&gt; tiempo, porque uno viaja a un universo que este atrasado 15 anios, y\n&gt;&gt; se encuentra a si mismo 15 anios mas joven.\n&gt;\n&gt;\n&gt; Hola Gabriel,\n&gt;\n&gt; El tema me interesa mucho (y recuerdo haber dado muchas vueltas sobre el\n&gt; mismo de chico) así que le dedico un poco más de tiempo que lo usual...\n&gt; Debo decir que levantaste una interesante cuestión, no sé si agradecerte\n&gt; o calentarme por haber escrito tremendo mail :)\n&gt;\n&gt; En realidad si te fijás en mi mensaje, decía que:\n&gt;\n&gt;\n&gt;         &quot;Yo pienso que si existiese la posibilidad de retroceder en el\n&gt;         tiempo, lo que tendría que suceder tendría que ser análogo a lo\n&gt;         que sucedería si uno no retrocediera en la línea de tiempo en la\n&gt;         que se encuentra, sino que saltara a un momento anterior en una\n&gt;         línea de tiempo paralela e idéntica.&quot;\n&gt;\n&gt;\n&gt; Lo de análogo era un detalle importante: no creo que realmente existan\n&gt; líneas de tiempo paralelas (o me parece en todo caso un detalle\n&gt; irrelevante, su posible existencia), pero creo que ése es un modelo\n&gt; bastante gráfico de la manera en que tiene que comportarse el viaje en\n&gt; el tiempo según cómo creo funcionan estas cosas. Mostrando, por ejemplo,\n&gt; que si uno va al pasado y mata al primer tipo igual a él que encuentra,\n&gt; no se modifica a sí mismo de ninguna manera.\n&gt;\n&gt; Pero tengo una idea mucho más difícil y larga de explicar, pero que me\n&gt; cierra mucho más (aunque no sé qué tan válida pueda ser).\n&gt;\n&gt; Tengo que admitir que estoy buscando alguna forma de explicarla desde\n&gt; hace rato... ensayé con todo tipo de explicaciones incluyendo frases\n&gt; como &quot;el universo es una bola cuatridimensional enorme (igual a la que\n&gt; describe Hawking cuando habla de universo finito y sin borde, y cosas\n&gt; similares) y dinámica, que se transforma con el transcurso de algo que\n&gt; podemos llamar el meta-tiempo&quot;... pero les puedo asegurar que no\n&gt; encontré forma de que suene aunque sea mínimamente cuerdo.\n&gt;\n&gt; Así que voy a explicarlo con un supuesto mundo bidimensional (una\n&gt; coordenada espacial más tiempo), a partir del cual la analogía debería\n&gt; ser clara. Para que no sea tan denso de leer también, voy a ayudarme de\n&gt; algunos mínimos gráficos.\n&gt;\n&gt; El siguiente gráfico es un ejemplo de mundo bidimensional, durante el\n&gt; transcurro del meta-tiempo:\n&gt;\n&gt;                                   M0:\n&gt;\n&gt;                                   M1:\n&gt;\n&gt;                                   M2:\n&gt;\n&gt;                                   M3:\n&gt;\n&gt;\n&gt; En cada instante de meta tiempo M, el universo es el mismo. Y en cada\n&gt; caso, cuenta la misma historia, de un mundo unidimensional donde\n&gt; aparecen dos partículas (una negra y otra roja), se mueven un poco en\n&gt; zig-zag, y luego desaparecen (primero la roja, luego la negra).\n&gt;\n&gt; En cada instante de tiempo M, el universo es la historia de todo un\n&gt; mundo, desde el principio hasta el fin de los tiempos. Si en el tiempo\n&gt; M2 una partícula adquiriera conciencia, esa partícula tendría conciencia\n&gt; sólo durante M2, y en M3 dejaría de existir. Lo cual es un decir porque\n&gt; el meta-tiempo y el tiempo son como filas y columnas de una misma tabla,\n&gt; no hay correspondencia entre ambos.\n&gt;\n&gt; Pero antes de seguir, prestemos atención a M0:\n&gt;\n&gt;                                   M0:\n&gt;\n&gt; El universo de M0 &#39;es computado&#39; por la gran máquina del mundo de la\n&gt; siguiente forma: se empieza por la izquierda, y de acuerdo a ciertas\n&gt; reglas que desconocemos (de las cuales la física es un modelo bastante\n&gt; completo), se calcula cada línea vertical en base a la línea anterior\n&gt; (se computa el estado actual en base al estado anterior). Al contrario\n&gt; de lo que comúnmente se cree, estas reglas no deben ser necesariamente\n&gt; no-determinísticas, lo que dice la física cuántica en cambio es que\n&gt; somos nosotros los que no podemos determinar con precisión cuál será el\n&gt; siguiente estado a partir del anterior.\n&gt;\n&gt; Según este modelo del mundo, así como existen unas reglas de física que\n&gt; determinan de qué manera se computa cada línea horizontal del universo\n&gt; (estado para un instante de tiempo dado), existen reglas que podemos\n&gt; llamar &#39;de meta-física&#39; (haciendo caso omiso de la usual acepción\n&gt; filosófica), que dicen cómo se computa un universo a partir del universo\n&gt; del instante de meta-tiempo anterior. En este caso no hay nada\n&gt; interesante que hacer, así que siempre se computa el mismo universo.\n&gt;\n&gt;\n&gt; Ahora supongamos otro ejemplo, en el que se permite el viaje en el\n&gt; tiempo. La partícula roja es la misma que antes, pero esta vez en vez de\n&gt; desaparecer donde lo hacía, vuelve en el tiempo y se destruye a sí\n&gt; misma.\n&gt;\n&gt; Vamos por partes, en el meta-tiempo M0, sucede lo siguiente:\n&gt;\n&gt;                                   M0:\n&gt;\n&gt; Se cruzan, todo como antes, pero la partícula &#39;vuelve al pasado&#39;. A los\n&gt; efectos de este universo bidimensional, la partícula simplemente\n&gt; desaparece. En realidad lo que sucede es que lo que sea que esa\n&gt; partícula haya hecho en este universo para iniciar su regresión en el\n&gt; tiempo, provoca su aparición en el siguiente instante de meta-tiempo.\n&gt;\n&gt;                                   M1:\n&gt;\n&gt; En M1 se ve el primer fenómeno &#39;raro&#39;. Todo empieza sucediendo de\n&gt; acuerdo a las reglas comunes de la física, y de repente sucede un\n&gt; fenómeno que se basa en cambio por las reglas de la meta-física. Aparece\n&gt; una segunda partícula roja (que dibujo y llamo verde para evitar\n&gt; confusiones), que además es agresiva y pronto devora a la partícula roja\n&gt; y a la negra.\n&gt;\n&gt; Claro que eso a la partícula verde no le provoca nada nuevo. En el\n&gt; universo tal como está en este instante de meta-tiempo, ella apareció de\n&gt; la nada, sin tener ninguna relación con la roja que solía ser (excepto\n&gt; por ser su homicida). Y fin del chiste del viaje al pasado para evitar\n&gt; que se casen los padres de uno...\n&gt;\n&gt; En sucesivos instantes de meta-tiempo, como no pasa nada interesante, el\n&gt; universo se mantiene estático, tal como solía ser en M1:\n&gt;\n&gt;                                   M2:\n&gt;\n&gt;                                   M3:\n&gt;\n&gt;                                   M4:\n&gt;\n&gt; Bueno, trasladando esta misma idea (si es que la supe explicar bien), a\n&gt; un mundo que tiene 3 dimensiones espaciales y una temporal, lo que\n&gt; tendríamos sería un universo que es una bola cuatridimensional, que se\n&gt; transforma en la medida en que avanza el meta-tiempo.\n&gt;\n&gt; Algunos comentarios al margen:\n&gt;\n&gt;\n&gt;       * Como &#39;&#39;teoría&#39;&#39; sigue pareciéndome sucia e infantil (cada vez\n&gt;         que tengamos un problema vamos a agregar dimensiones al universo\n&gt;         para entenderlo?), pero es la mejor que se me ocurrió hasta\n&gt;         ahora. Acepto otras ideas (y espero con entusiasmo!).\n&gt;       * A simple vista la idea parece cerrar, sin embargo es probable\n&gt;         que alguien que realmente sepa del tema pueda señalar enseguida\n&gt;         algún punto en el que la cosa contradice alguna teoría\n&gt;         fundamental de la física... por ello, no le doy demasiado\n&gt;         crédito y supongo que ustedes tampoco deberían hacerlo... pero\n&gt;         sirve para divertirse un rato :)\n&gt;       * Ahora que leyeron el mail, fíjense la manera en que lo que\n&gt;         explicaba en mi anterior mail funciona como analogía sencilla\n&gt;         del funcionamiento de lo que explico arriba :)\n&gt;       * El uso de la palabra &#39;meta-física&#39; no es el usual, pero creo que\n&gt;         sigue siendo la mejor palabra para describir lo que estaba\n&gt;         explicando (algo que sea al meta-tiempo, lo que es la física al\n&gt;         tiempo)...\n&gt;       * A pesar de mi gran esfuerzo, no creo que haya podido ser claro\n&gt;         en mi explicación... cualquier duda pregunten, y si no\n&gt;         entienden, es mi culpa :)\n&gt;       * Cuestiones como ésta demuestran que las ciencias exactas dan\n&gt;         lugar a discusiones sobre cosas rarísimas\n&gt;\n&gt;\n&gt; Saludos,\n\n\n\n-- \nノイド★エグゼ\n*Noid.EXE*\n\n"}}