{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":213721064,"authorName":"&quot;Noid.EXE - ノイド☆エグゼ&quot;","from":"=?UTF-8?B?Ik5vaWQuRVhFIC0g44OO44Kk44OJ4piG44Ko44Kw44K8Ig==?= &lt;noidexe@...&gt;","profile":"noidmh","replyTo":"LIST","senderId":"A5IyVIR7T_1_Q5bUphrR97sSaZj_Ee8fn_4U5yXwsc94YleOlxeeERpKL-Nkwa2hOt9WeJki5FrJ4J5hMVmspl-BWZEEWRzcDClulArPRtTzWCpdxjX6TDALC_vuT5-J0wC84lHEVO6x31ualPxGoqdBy_0Xwrw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [JuegosAr] Serious Games y La actitud  de las universidades en este país.","postDate":"1146524769","msgId":15460,"canDelete":true,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NTY5NDYxLjMwODA4MDJAZ21haWwuY29tPg==","inReplyToHeader":"PDVmMWE4NWYwMDYwNDMwMTQ0NnQ2MzAwNzZiYWlkMWUwY2Q3ODlmOGM2ZDRmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDVmMWE4NWYwMDYwNDMwMTQ0NnQ2MzAwNzZiYWlkMWUwY2Q3ODlmOGM2ZDRmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":15454,"nextInTopic":15462,"prevInTime":15459,"nextInTime":15461,"topicId":15452,"numMessagesInTopic":5,"msgSnippet":"Pensa que vivimos en un pais donde el concepto de descentralizacion nunca llego. En el profesorado donde yo estudio desde el año pasado que se inauguro el","rawEmail":"Return-Path: &lt;noidexe@...&gt;\r\nX-Sender: noidexe@...\r\nX-Apparently-To: JuegosAR@...\r\nReceived: (qmail 21921 invoked from network); 2 May 2006 16:13:15 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m25.grp.scd.yahoo.com with QMQP; 2 May 2006 16:13:15 -0000\r\nReceived: from unknown (HELO xproxy.gmail.com) (66.249.82.204)\n  by mta1.grp.scd.yahoo.com with SMTP; 2 May 2006 16:13:15 -0000\r\nReceived: by xproxy.gmail.com with SMTP id i27so1926130wxd\n        for &lt;JuegosAR@...&gt;; Tue, 02 May 2006 09:13:15 -0700 (PDT)\r\nReceived: by 10.70.33.3 with SMTP id g3mr1091746wxg;\n        Tue, 02 May 2006 09:13:15 -0700 (PDT)\r\nReturn-Path: &lt;noidexe@...&gt;\r\nReceived: from ?192.168.2.28? ( [201.255.193.105])\n        by mx.gmail.com with ESMTP id i37sm3222516wxd.2006.05.02.09.13.11;\n        Tue, 02 May 2006 09:13:14 -0700 (PDT)\r\nMessage-ID: &lt;44569461.3080802@...&gt;\r\nDate: Mon, 01 May 2006 20:06:09 -0300\r\nUser-Agent: Mozilla Thunderbird 1.0.7 (Windows/20050923)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: JuegosAR@...\r\nReferences: &lt;5f1a85f00604301446t630076baid1e0cd789f8c6d4f@...&gt;\r\nIn-Reply-To: &lt;5f1a85f00604301446t630076baid1e0cd789f8c6d4f@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: =?UTF-8?B?Ik5vaWQuRVhFIC0g44OO44Kk44OJ4piG44Ko44Kw44K8Ig==?=\n &lt;noidexe@...&gt;\r\nSubject: =?UTF-8?B?UmU6IFtKdWVnb3NBcl0gU2VyaW91cyBHYW1lcyB5IExhIGFjdGl0dWQ=?=\n =?UTF-8?B?IGRlIGxhcyB1bml2ZXJzaWRhZGVzIGVuIGVzdGUgcGHDrXMu?=\r\nX-Yahoo-Group-Post: member; u=213721064; y=5WmIUa9cSXwdz5fI4yxB6Y6c29NTSlgtWYHFoOEmDwWF\r\nX-Yahoo-Profile: noidmh\r\n\r\nPensa que vivimos en un pais donde el concepto de descentralizacion \nnunca llego. En el profesorado donde yo estudio desde el año pasado que \nse inauguro el edificion nuevo hay una sala de computacion, unas 20 \nmaquinas con dual boot(WinXP + Madrake 10.0) y todavia no tienen idea de \nque hacer con ellas. Tienen cantidad de programas instalados, y supongo \nque los que estudian analisis de sistemas las usaran(yo no curso esa \ncarrera) pero el hecho es que la mayor parte del tiempo estan todas las \nmaquinas al pedo y un dia se me ocurrio preguntar si podia usar una y me \ndijeron que tenia que pedirle autorizacion al director y que tenia que \nser dentro de tal y tal horario. Se que en todos lados no es asi, pero \nen general todas las instituciones argentinas tienen una estructura \nultracentralizada y burocratizada. Todo el mundo se la pasa quejandose \ndel presupuesto pero para mi el problema es la incompetencia, vivimos en \nun pais donde hasta para pedir una caja de tizas tenes que llamar al \nministro de educacion, pero ojo, que el que maneja la guita es el \nministro de economia asi que el ministro de educacion le tiene que pedir \nal de economia que le compre una caja de tizas, y el ministro de \neconomia, con la debida autorizacion del presidente hace un estudio de \nmercado para ver donde puede conseguir unas tizas baratas y buenas y asi \nhasta que las tizas lleguen(con suerte) a manos del que la necesita.\nYo hace poco cree una lista de correo en yahoo groups, pero hay mucha \ngente que nisiquiera entiende lo que es una lista de correo, y no se que \ntal me vaya con la idea, obviamente nunca le dije nada a la \nadministracion porque me dirian que no tienen tiempo de administrar mas \ncosas y seria inutil tratar de que les entre que eso se administra \npracticamente solo.\nAsi y todo pienso que tu proyecto es muy bueno, y que va  a costar pero \nva a tener exito. Yo lo que te diria es que no lo presentes como un \nproyecto a nadie. Ponelo en linea lo mas pronto posible(si ya lo tenes \npasame el link) y trata de conseguir voluntarios que te ayuden, y la \npromocion hacela entre los alumnos primero y una vez que este algo mas o \nmenos armado les vas pasando la data a los profesores. No se, capaz que \ntodo esto que te digo ya lo sabes, pero me parecio bueno decirte que no \nquieras hacer un proyecto desde arriba.\nChe, no se si a los demas les interese, pero por lo menos a mi me \ninteresaria saber mas datos sobre el proyecto y si es posible algun link \nque les pueda pasar a mis profesores, hay unos pocos que tienen la \ncabeza en este siglo y les interesaria mucho un proyecto si, y ayudaria \na que se corra la bola de lo que estas haciendo.\n\nPablo Weremczuk wrote:\n\n&gt; Hola todos,\n&gt;\n&gt; Hace poco trate de impulsar el uso de un administrador de contenidos \n&gt; para brindar asistencia a los alumnos, en el se generarían foros para \n&gt; las materias, mismos que estarían moderados por los \n&gt; profesores/ayudantes de cátedra  y brindarían apoyo, no solo a los \n&gt; alumnos de la universidad sino a alumnos de otras universidades. Esto, \n&gt; lejos de perjudicarnos contribuiría a la generación de conocimientos \n&gt; para que los alumnos tengan una fuente de información especifica del \n&gt; temario que se da en las materias, además de optimizar el tiempo \n&gt; dedicado por los profesores para la asistencia a distancia(hoy día se \n&gt; utilizan grupos yahoo o directamente mails a los profesores).\n&gt;\n&gt; Durante mi exposición dejé bien en claro que mi única intención era la \n&gt; de generar un punto de encuentro entre los profesores y alumnos, que \n&gt; no me interesaba ser el webmaster ni que mi nombre figure, ni publicar \n&gt; publicidad ni lemas políticos y haciendo énfasis en que no perseguía \n&gt; otro fin que el de mejorar la forma en que se obtenía ayuda en la \n&gt; universidad.\n&gt;\n&gt; Hace un año que estoy tratando de llevar esto adelante, y he \n&gt; encontrado mucha resistencia por parte de los profesores. La semana \n&gt; pasada tuve una entrevista con el jefe de cátedra de sistemas de \n&gt; computación, donde le mostré el sitio(que esta andando desde hace un \n&gt; año) y explique la visión que yo tenía. Esta persona me escucho \n&gt; atentamente y vió todo lo que tenía para mostrar. Finalmente, sin \n&gt; dejar de ver la pantalla, meneo la cabeza y dijo:\n&gt;\n&gt; &quot;Realmente es una idea genial, el sitio es muy potente y tiene mucho \n&gt; trabajo encima, es una lastima que no pueda utilizarlo.&quot;\n&gt;\n&gt; Acto seguido me explico que la universidad ofrecía hosting a los \n&gt; profesores, pero bajo parámetros ridículos(ej. paginas HTML de 1k \n&gt; total) y que ellos utilizaban grupos yahoo para tratar de brindar \n&gt; soporte &quot;a escondidas&quot;, ya que la universidad no permitía a los \n&gt; profesores nada que no fuera &quot;bancado por la universidad&quot; o avalado \n&gt; por la misma bajo los parámetros mencionados, y que, pese a que \n&gt; estaban tratando desde hace tiempo vencer la resistencia de los \n&gt; alumnos a realizar preguntas, no habían tenido éxito y que lo que yo \n&gt; proponía les parecía un buen punto de comienzo. Terminado esto, me \n&gt; acompañó a la puerta, me palmeo la espalda y me dijo: \n&gt; &quot;desilucionado?&quot;, a lo que le contesto &quot;es mas o menos lo que \n&gt; esperaba, ya que tuve mucha resistencia de parte de los profesores \n&gt; pero no comprendía por que&quot;.\n&gt;\n&gt; Luego de comentar esto con algunos compañeros de trabajo, mi jefe me \n&gt; dijo, &quot;si a mi me paso lo mismo cuando cursé, y los profesores me \n&gt; decían -sabes cuantas iniciativas de estas rebotaron?!?-&quot;, otro \n&gt; compañero me mostró un proyecto para su universalidad, que era una \n&gt; pagina web estática para bajar apuntes, y me dijo que el profesor no \n&gt; mostró interés en utilizarla, acto seguido me muestra lo que estaban \n&gt; usando actualmente. Mas alla del diseño lamentable, resumiré \n&gt; describiendo el sitio como &quot;arcaico y obsoleto&quot;, aparte de tener \n&gt; navegabilidad y estabilidad &quot;bajo cero&quot;(fondo blanco con letras \n&gt; amarillas, downloads sin descripción(ej, link1, link2, link3) y uso \n&gt; indiscriminado del fondo purpura para resaltar conceptos aleatorios).\n&gt;\n&gt; Por que la universidades descartan estas iniciativas y se empecinan en \n&gt; no utilizar tecnologías presentes desde hace décadas? Como pretender \n&gt; que se adopte algo como &quot;serious games&quot; si no podemos generar ni \n&gt; siquiera un portal de educación común para una sola universidad? Ni \n&gt; hablar de unificar programas entre universidades y hacer un portal \n&gt; centralizado!!!!!!\n&gt;\n&gt; Los nombres tanto de las universidades como de las personas no vienen \n&gt; al caso, ahora mismo estoy un poco frustrado por lo que les acabo de \n&gt; contar y no soy capaz de emitir un juicio justo a la situación, por \n&gt; eso quería recibir algunas opiniones de ustedes.\n&gt;\n&gt; Disculpen si la redacción no es del todo correcta, pero estoy medio \n&gt; cruzado y me salió así.\n&gt;\n&gt; Quedo atento a sus opiniones.\n&gt;\n&gt; Gracias desde ya.\n&gt;\n&gt; Saludos\n&gt;\n&gt; -- \n&gt; Pablo R. Weremczuk\n&gt; http://www.weremsoft.com.ar/\n&gt;\n\n\n-- \n[[AVATAR_PIC]]\n*ノイド☆エグゼ*\n*Noid.EXE*\nWeb: (http://noidexe.deviantart.com)\nMail: noidexe@...\nJabber ID / GTalk: noidexe@...\nMSN: noidmh@...\nICQ: 227647063\nYahooIM ID: noidmh\nKey ID: 0xC36809CA\n\n--enviado con: Get Thunderbird! \n&lt;http://www.spreadfirefox.com/?q=affiliates&id=0&t=178&gt; 1.0.7--\n\n--navegando con: Get Firefox! \n&lt;http://www.spreadfirefox.com/?q=affiliates&id=0&t=83&gt; 1.5.0.1--\n\n\n\n"}}