{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"CREATE"},{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Andrés Chilkowski","from":"=?iso-8859-1?Q?Andr=E9s_Chilkowski?= &lt;chilk@...&gt;","replyTo":"LIST","senderId":"VkdzfLA_-YhOfxP18TpMRTnCnfxLGbZYuGbgd6YGYjqJ_nvEkVzI_xLr4mOlJm50lkPDQZu_63JKEhLqE12rnK8pxSxqLZTbfTG4aBSgYcrvrxi08ONGbCVjGvWh6QsPnXz7Eg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [JuegosAR] Algunos puntos y sus respuestas","postDate":"993586252","msgId":2068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWMwZmU3YyQxYTE3MmM2MCQ1MDNhZTgxOEAxPg==","referencesHeader":"PDIwMDEwNjI2MTE1OTM2LjUyOWJlZDcxLm5ncmVjb0Bzb2Z0aG9tZS5uZXQ+"},"prevInTopic":0,"nextInTopic":2104,"prevInTime":2067,"nextInTime":2069,"topicId":2068,"numMessagesInTopic":13,"msgSnippet":"Debo confesar que luego de la reunion en elsitio, me asaltaron pensamientos paranoides similares a los de Santiago. Claro que de una forma prejuiciosa, etc..","rawEmail":"Return-Path: &lt;chilk@...&gt;\r\nX-Sender: chilk@...\r\nX-Apparently-To: JuegosAR@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 26 Jun 2001 20:12:05 -0000\r\nReceived: (qmail 41428 invoked from network); 26 Jun 2001 20:12:05 -0000\r\nReceived: from unknown (10.1.10.142) by l8.egroups.com with QMQP; 26 Jun 2001 20:12:05 -0000\r\nReceived: from unknown (HELO juegosonline.com) (200.42.142.16) by mta3 with SMTP; 26 Jun 2001 20:12:04 -0000\r\nReceived: from 1 [24.232.58.80] by edusoft.com.ar [200.42.142.16] with SMTP (MDaemon.v3.5.7.R) for &lt;JuegosAR@yahoogroups.com&gt;; Tue, 26 Jun 2001 17:11:11 -0300\r\nMessage-ID: &lt;001801c0fe7c$1a172c60$503ae818@1&gt;\r\nTo: &lt;JuegosAR@yahoogroups.com&gt;\r\nReferences: &lt;20010626115936.529bed71.ngreco@...&gt;\r\nSubject: Re: [JuegosAR] Algunos puntos y sus respuestas\r\nDate: Tue, 26 Jun 2001 17:10:52 -0300\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 5.50.4133.2400\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4133.2400\r\nX-MDRemoteIP: 24.232.58.80\r\nX-Return-Path: chilk@...\r\nX-MDaemon-Deliver-To: JuegosAR@yahoogroups.com\r\nFrom: =?iso-8859-1?Q?Andr=E9s_Chilkowski?= &lt;chilk@...&gt;\r\n\r\nDebo confesar que luego de la reunion en elsitio, me asaltaron pensamientos\nparanoides similares a los de Santiago. Claro que de una forma prejuiciosa,\netc.. podria poner como excusa que debido a experiencias malas que no tienen\nnada que ver con esto, ese lugar me pone en ese estado :).\n\nCHILK: y bueno... sos medio paranoico entonces.. :)\n\nSantiago tiene todo el derecho del mundo a desconfiar, aunque me parece\nque en algunos casos &#39;mea afuera del tarro&#39; (por ej, en postear logs de\nicq.)\nY me parece que esta pelea tiene que servir al menos para definir un poco\nlos\nroles de Adva.\n\nCHILK: Totalmente de acuerdo\n\nNo creo que alguien tenga &#39;malas intenciones&#39;, si pienso que chilk & cia\npueden\ntener perspectivas de &#39;usar&#39; Adva como un lugar donde &#39;cazar talentos&#39;, lo\ncual\nno esta para nada mal!!, lo que si estaria mal es que, habiendo equipos ya\nformados, o gente como santiago que labura sola, quisieran &#39;apropiarse&#39; de\nalguna\nmanera de lo ya hecho (y aca no me refiero a chilk,etc, en particular, sino\na\ncualquier &quot;business-man&quot;), o aprovecharse usando su autoridad en el tema\npara\ndar una vision erronea de lo que es negociar con publishers, y tratar de\n&#39;convencer&#39; al otro de que la unica manera de vender su game es a traves de\nel.\n\nY de acuerdo a mi experiencia con business-man de todo tipo, hasta agregaria\nque si hiciesen esto, no estarian sintiendose que &quot;cagaron&quot; al otro, sino\nque\nrealmente sin ellos el otro no podria haber triunfado, y puede que tengan\nrazon, o no. Pero justamente ese &quot;no&quot; final es el que nos da la\njustificacion\na cada uno de elegir negociar como nos plazca.\n\nCHILK: el bizguy no solo negocia... esto no tiene que ver conmigo... pero\nlamentablemente estamos en una situacion tan precaria que nuestras chances\nde hacer un producto comercializable estan dictadas totalmente por la\nnaturaleza del mercado... cualquier producto con intencion de ser\ncomercializable tiene que estar de acuerdo con los &quot;que se vende&quot; y &quot;por que\nse vende&quot;\n\nEsto se arregla asi:\n\n* Tener una lista.txt publica de telefonos y direcciones de publishers.\n  Esta info es publica si browseamos un poco con google, pero igualmente\nevita\n  que nadie se haga valer por tener esos 3kb en su Palm. De lo que en\nprincipio\n  se queja santiago es de que no le quisieron pasar los contactos.\n\nCHILK: es practicamente al pedo... no es lo mismo mandar un mail o fedexear\nun CD que conocer gente personalmente... o que de pedo caer en Los Angeles y\nenfrentar gente que no conoces cara a cara.\n\n* Si Santiago quiere hacer un juego solo, dejenlo. Aun si su proyecto\n  fuera inviable comercialmente, tener algo hecho es algo muy bueno para un\n  programador. El con su juego-no-vendido, si es de buena calidad, estaria\n  en posicion de conseguir laburos afuera. Sin contar con lo aprendido.\n\nCHILK: antes de propopnerle nada le pregunte a donde queria ir con lo que\nestaba haciendo... segun lo que me dijo el ademas de apreneder queria\nterminar el juego y ver si se lo podia acercar a un publisher... (me parecio\nperder tiempo al pedo... mi intencion fue ayudarlo)\n\n* Como dije antes, olvidarse de la palabra &#39;incubadora&#39;, incubadora es\n  algo que se define, y tiene razon de ser, en invertir guita en varios\n  equipos/empresitas, aca no es asi.\n  Hay un proyecto de chilk para formar un equipo para su juego, me parece\nok.\n  El que quiera poner su talento de &#39;lider y organizador&#39;, que forme su\nequipo,\n  o se integre a uno ya existente.\n  Es **-ridicula-** la idea de un &#39;lider-organizador&#39; que vaya de equipo\n  en equipo de Adva diciendole que hacer, eso no es una &#39;incubadora&#39;.\n  Si yo tengo que obedecer a un &#39;lider&#39;, voy a querer que sea uno que este\n256%\n  comprometido con mi proyecto, y tengo que confiar en el 256%.\n  La unica manera de que exista algo similar a una incubadora, es cuando\nhaya\n  guita.\n\nCHILK: guita no va a haber... probablemente nunca hasta que salga un\nproyecto realmente viable a nivel internacional\nse que incubadora es un termino poco feliz...\nyo no me considero jefe de nadie... el management y la organizacion\ncomprende muchas cosas que no siempre tienen que ver con el liderazgo.\n\n\n\n* Si alguien quiere mandarse por su cuenta a buscar publishers, es su\ndesicion,\n   y quizas su problema, si realmente no puede vender su juego, se tiene\n   que dar cuenta solo, y al final ira buscar &#39;ayuda profesional&#39;. De\nultima,\n   todo el mundo tiene derecho a darse la cabeza contra la pared alguna vez.\n\nCHILK: obviamente que es su decision... pero cada proyecto que fracasa tiene\nun impacto negativo para todo el grupo... simplemente creo que hay que\nmaximisar las posibilidades de exito :)\n\n* DEFINIR bien que NO es el rol de Adva el intervenir en negociaciones\n  con publishers. Si alguien quiere especializarse en ser &#39;representante\n  de algunos equipos de argentina de programacion&#39;, que negocie, saque el\n  mejor precio, y se quede con una comision, me parece 100% perfecto\n  (obviamente, si mete un par de juegos en publishers grandes, todos vamos a\n  querer que venda nuestro game), que lo haga, pero que lo haga no como\n  miembro de Adva, ni que sea una funcion de esta. Lo cual obviamente no le\n  impide estar en la lista.\n\nCHILK: vuelvo al ejemplo de la asociacion escosesa o cualquier asociacion de\neste tipo... hay muchas cosas que perseguir en este ambito... asuntos\nlegislativos, ventajas comerciales, subsidios publicos, temas de propiedad\nintelectual.. hay entidades de este tipo para los industriales y para las\nempleadas domesticas... no entiendo por que no puede haber para los\ndesarrolladores de software o de software de entretenimiento.\n\n* Si se elige un lider para adva (con lo cual no estoy de acuerdo, y me\nparece\n  sin sentido por el momento), que cambie en forma rotativa y por eleccion\ncada\n  2 meses. Y antes definir, limitar, sus roles.\n\nCHILK: ok...\n\nNota final: aca hay algunos consejos de como presentar una demo:\nhttp://www.stratos-ad.com/recursos/cursos/consejos/consejo_05.htm\n\nCHILK: muy buenos los consejos.. :)\n\n\n\n\n"}}