{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"CREATE"},{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":32334982,"authorName":"niclam","from":"niclam &lt;niclam@...&gt;","replyTo":"LIST","senderId":"Z83WT9cSgNIZ2xMM4ZqRqi9xdYkNGbA3lRbClYh1nbBDrQ-T6HaH3TI95zu593isnqGAt6NEZI8v7vQGPDRluFfEjoo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Resumen de la reunion del 29 de Junio de 2002","postDate":"1025431117","msgId":4368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNjMwMDY1OC4zNzE2Mi5uaWNsYW1AY2l1ZGFkLmNvbS5hcj4="},"prevInTopic":0,"nextInTopic":4389,"prevInTime":4367,"nextInTime":4369,"topicId":4368,"numMessagesInTopic":5,"msgSnippet":"Hola a todos. Primero que nada quiero decirles que, a mi entender, esta fue una de las reuniones mas importantes que tuvo ADVA (ironicamente es una de las que","rawEmail":"Return-Path: &lt;niclam@...&gt;\r\nX-Sender: niclam@...\r\nX-Apparently-To: juegosar@yahoogroups.com\r\nReceived: (EGP: mail-8_0_7_4); 30 Jun 2002 09:59:31 -0000\r\nReceived: (qmail 74299 invoked from network); 30 Jun 2002 09:59:31 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m5.grp.scd.yahoo.com with QMQP; 30 Jun 2002 09:59:31 -0000\r\nReceived: from unknown (HELO arnet.com.ar) (200.43.128.196)\n  by mta2.grp.scd.yahoo.com with SMTP; 30 Jun 2002 09:59:27 -0000\r\nReceived: from hydralisk (hydralisk [192.168.5.3])\n\tby arnet.com.ar (Postfix) with ESMTP id F0A0DFAD8\n\tfor &lt;juegosar@yahoogroups.com&gt;; Thu, 27 Jun 2002 03:45:52 -0300 (ART)\r\nContent-Type: text/plain;\n  charset=&quot;us-ascii&quot;\r\nTo: JuegosAR@...\r\nSubject: Resumen de la reunion del 29 de Junio de 2002\r\nDate: Sun, 30 Jun 2002 06:58:37 -0300\r\nUser-Agent: KMail/1.4.2\r\nMIME-Version: 1.0\r\nContent-Transfer-Encoding: 8bit\r\nMessage-Id: &lt;200206300658.37162.niclam@...&gt;\r\nFrom: niclam &lt;niclam@...&gt;\r\nReply-To: niclam@...\r\nX-Yahoo-Group-Post: member; u=32334982\r\n\r\nHola a todos.\nPrimero que nada quiero decirles que, a mi entender, esta fue una de las \nreuniones mas importantes que tuvo ADVA (ironicamente es una de las que menos \ngente vino).\nAjustense los cinturones, porque es largo, aqui va:\n\nComencemos con los que asistieron a la reunion:\n\n- Porko, FrostBite y BichoFoo\n- Lucas Wall, Javier Otaegui\n- Santiago Siri\n- Hernan Moraldo\n- Andres Chilkowsky\n- Nicolas Lamanna\n- Una persona que no me acuerdo el nombre :) pero que es dibujante, trabaja en \nsistemas e hizo un comic mezcla de 3d y retocado en computadora.\n\n---= o =---\n\nCada uno de los participantes, nos comentaron en que andaban:\n\n- Primero la persona que no me acuerdo el nombre :) (pido disculpas), nos \nmostro sus trabajos, los cuales consistian en varios dibujos que fue haciendo \ny un comic hecho en 3d (Poser, 3DS models) y retocado con Photoshop.\n\n- Hubo una charla sobre Argentum, hacia donde iba dirigido y hubo un debate \ninteresante sobre la comunidad que se creo y las complicaciones al darle a la \nmisma demasiado poder para elegir como llevar el juego.\n\n- Andres Chilkowsky nos conto los proyectos de Edusoft (en conjunto con otros \ndesarrolladores tales como Sabarasa y Codenix). Tambien hablo de EDreams \n(Juegos Online vendria a ser parte de EDreams) y de que el proximo mes \nestrenan oficinas.\n\n- Sabarasa sigue trabajando en el Avery Cardoza Chess, para terminar les falta \naspectos de la parte grafica y debugging-stage. \nEl Instituto Superior Santo Domingo de Cordoba se contacto con ellos para \nofrecerles ir a dar una charla sobre desarrollo de juegos. Nicolas Vinacur \nfue el encargado de ir. El Instituto piensa brindar cursos breves de \ndesarrollo (estilo IAC).\nPor ultimo nos contaron que estan desarrollando un juego para Game Boy \nAdvance.\n\n- Santiago Siri (Evoluxion) nos conto sobre el progreso que esta haciendo en \nsu Futbol Deluxe. Se le ocurrieron varias ideas durante el ultimo mundial \n(bueno, todavia no termino, en un ratito nomas ;)), para lograr que el juego \nsea innovador. Llego a una instancia donde necesita contratar gente para \npoder completar ciertas partes del juego que le requeririan mucho tiempo \n(ingreso de datos, arte), para ello esta pensando conseguir financiacion a \ntraves de un demo que tiene planeado lanzar.\n\n- Hernan Moraldo charlo sobre la exhaustiva investigacion que realizo sobre la \nindustria de juegos shareware. Menciono que generalmente los juegos shareware \nlos hace 1 persona (a veces mas). Mostro el Randomedia funcionando, con un \ngameplay parecido al EDIA, igualmente nos dijo que el gameplay iba a ser \ncompletamente diferente y que iba a ser uno de sus puntos destacados.\n\n- Porko, Frostbite y BichoFoo mostraron una still image con arte (hecho por \nFrostBite), en un emulador de PlayStation. Estan trabajando en un juego de \nlucha para la consola y tambien investigando otro tipo de consolas (Game Boy \nAdvance).\n\n- Nicolas Lamanna conto sobre Codenix y los problemas de \norganizacion/comunicacion latentes en un grupo donde los miembros se \nencuentran cada uno en su casa. Tambien hablo sobre que llegaron a un punto \nque para seguir Larvotor (el motor que se encuentran desarrollando) y \nterminarlo en un plazo razonable de tiempo, necesitaban conseguir \nfinanciacion (para contratar artistas, conseguir oficinas, etc). Es por ello \nque se encuentran en tratativas para desarrollar dos juegos para Game Boy \nAdvance, uno en conjunto con Edusoft/JuegosOnline y el otro por su cuenta.\n\n- Misc:\n Se hablo de Image campus, quienes hacen modelado/animacion por computadora. \nVan a brindar cursos sobre desarrollo de juegos. Cubriran diferentes aspectos \ntales como programacion, disenio y arte.\n Javier Otaegui nos conto sobre un proyecto para subsidiar emprendimientos de \nempresas de alumnos y graduados de universidades e intitutos terciarios, \nllevado a cabo por el gobierno. Pueden encontrar mas informacion en: \nhttp://www.buenosaires.gov.ar/prueve/\n\n---= o =---\n\nCon respecto al Sitio de ADVA:\n\n- Se mostro el progreso de la pagina de ADVA en ingles. Hernan Moraldo comento \nla idea de que cuando este el sitio en la lengua anglosajona, entonces seria \nbuena idea contactar a otros sitios (gamedeveloper.net, flipcode, gamedev), \npara informarles de nuestra existencia :).\n- Foros: Se encuentra en etapa de prueba\n- Se planteo la idea de agregar una seccion de Artistas, en donde habria un \nlistado de los mismos y cada uno tendria su portfolio, datos para poder ser \ncontactados por quien pueda necesitarlos (sea un miembro de adva o de algun \nusuario que vio la pagina) y aptitudes.\n- Seccion Business (o Hire, o Contract Work, titulo sujeto a modificaciones): \nAqui estarian todos los datos necesarios para que la gente que quiere \ninvertir en los diferentes grupos, sepa como hacerlo, que se necesita \ngeneralmente, tiempos y valores estimados, etc. Se hablo de poner una \nsubseccion clasificados.\n\n---= o =---\n\nDecisiones importantes sobre ADVA en general:\n\n**** IMPORTANT STATEMENT ****\n\n La lista permanece de manera interna y los integrantes de la misma, son los \nque controlan ADVA mediante votacion.\n\n********************************************\n\n- La gente que quiere ser miembro de ADVA, puede serlo accediendo desde el \nboton &#39;Registrate&#39; en el home (nota: esto es completamente separado de la \nlista).\nSe definieron dos tipos de miembros:\n\n\t- User account: Se registra directamente con un formulario (confirmado por el \nusuario), con datos como nombre y apellido, aptitudes, etc. \n\tVa a existir un listado aparte del actual (grupos), donde se podran browsear \nmiembros (a la gamedev.net). Aqui van a estar todas las personas individuales \nque no forman parte de ningun grupo, artistas (los cuales van a aparecer en \nla seccion &#39;Artistas&#39;), desarrolladores, diseniadores, level editors, etc.\n\n\t- Grupo: Aqui va a haber un texto descriptivo de las condiciones que deben \ncumplir los que quieran ingresar grupos. Los mismos se muestran en un listado \nsimilar al actual pero -y aqui viene una de las decisiones mas importantes-, \nlos grupos que se dedican en serio al desarollo, van a estar destacados.\n\nAhora, es relativo y muy subjetivo la forma en que se decide, quien se destaca \ny quien no, pero esto es para evitar gente que agrega un grupo porque si. Ya \nque cualquiera puede hacerlo. Decidimos no limitar el cupo a nadie, solo que \nlos que lo hacen en serio van a estar destacados. Esto &#39;educa&#39; de cierta \nmanera al &#39;usuario&#39; de ADVA.\n\nEl tema es el siguiente, y en lo cual no nos pusimos de acuerdo:\n\nComo se destacarian los grupos?\n\nLos ejemplos mas concretos son los de IGDA y Gamasutra.\nEn ese caso, el factor que define si un grupo es destacado o no, es comercial \n(pagan mas).\nEn nuestro caso, y al ser una organizacion sin fines de lucro, en su infancia, \ncobrar is not an option :).\n\nEntonces, se decidio una votacion oficial para la lista:\n\n- COMO se destacan los grupos en la seccion miembros?\n\nOpciones: \n- Tipo IGDA (aparece la fila con otro color de fondo, logo y con mayor \ninformacion sobre el grupo)\n- En el listado principal, aparecerian iconos que indicarian si el grupo tiene \ncalidad aceptable o los proyectos terminados.\n- Proponer una idea\n\nEl Plazo para votar es de 1 (una) semana a partir del Lunes 1 de Julio de \n2002.\n\n---= o =---\n\nCon respecto a IGDA\n- Andres Chilkowsky, encargado de los temas internacionales de ADVA, le envio \nun mail (previamente aceptado por la lista, obviamente) a Jason Della Roca, \ncomentandole que el sabado teniamos una reunion.\nJason envio un documento de &#39;IGDA chapters&#39; a Andres, quien en estos dias lo \nestara enviando a la lista. El mismo incluye temas como reuniones, \nfinanciamiento, cuestiones sociales, ser chapter de IGDA, etc.\n\nTodos estuvimos de acuerdo en aceptar ser &#39;Argentina IGDA Chapter&#39;, para lo \ncual no es necesario pagar, como es el caso de una membrecia.\n\nLa idea es aceptar serlo, oficialmente, cuando este el sitio en ingles. El \ncual estara a mas tardar para el miercoles 3 de Julio.\n\n---= o =---\n\nProyecto de Ley de software de exportacion\n\nExiste un proyecto de Ley de un diputado, sobre el desarrollo de software.\nEl mismo contempla la baja de aranceles para importacion de hardware/software, \nbajar los aportes para contratar gente y otros beneficios para varios rubros \nde desarrollo de software para exportacion.\nUno de los principales problemas fue que no figura el rubro &#39;desarrollo de \nsoftware de entretenimiento&#39;, por lo cual Javier Otaegui junto con un \nfamiliar que es abogado y Nicolas Lamanna (u otras personas quizas), iran a \nmodo de mision, a hablar con el diputado para contemplar la inclusion del \nrubro que nos compete.\n\n---= o =---\n\nCualquier comentario, critica, bienvenido sea.\n\nBueno, eso es todo. En la semana, Hernan Moraldo se hara cargo de transcribir \neste resumen de manera formal a la pagina (Castellano e Ingles).\n\nSaludos\n\n-- \nniclam / CodeNix\nMay your bytes, rest in bits...\n\n"}}