{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Pablo Zuccarino","from":"&quot;Pablo Zuccarino&quot; &lt;zuk@...&gt;","replyTo":"LIST","senderId":"mUu1qhTx2qZJV_8d4UKG06vTI4MHbwSLHY2_CghMq0HmVLZCywZ4iOA-a18nRBPco-b6kSbdUujMT8UZrs7-dr7QxSuL_4yoch696EY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ideas","postDate":"983983649","msgId":460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEdPRUJLSkpJSE1ISk5EQkNDSUNET0VJSENHQUEuenVrQGVsc2l0aW8uY29tLmFyPg==","inReplyToHeader":"PDNBQTY0NkY3NUEuRkNDQ0dBQlJJRUxAbWFpbC5jb3BldGVsLmNvbS5hcj4="},"prevInTopic":458,"nextInTopic":465,"prevInTime":459,"nextInTime":461,"topicId":444,"numMessagesInTopic":18,"msgSnippet":"Gente: Como decia, esto se puso interesante. Demasiado, quizas. Llego y tengo 30 mails con exposiciones de la industria, los equipos y ADVA! Lamentablemente,","rawEmail":"Return-Path: &lt;zuk@...&gt;\r\nX-Sender: zuk@...\r\nX-Apparently-To: JuegosAR@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 7 Mar 2001 16:47:15 -0000\r\nReceived: (qmail 11970 invoked from network); 7 Mar 2001 16:47:13 -0000\r\nReceived: from unknown (10.1.10.27) by m8.onelist.org with QMQP; 7 Mar 2001 16:47:13 -0000\r\nReceived: from unknown (HELO serverd.elsitio.com.ar) (200.32.96.140) by mta2 with SMTP; 7 Mar 2001 16:47:12 -0000\r\nReceived: from esxpzuccarino [172.16.7.229] by serverd.elsitio.com.ar (SMTPD32-6.05) id A939135F00C6; Wed, 07 Mar 2001 14:00:41 -0300\r\nTo: &lt;JuegosAR@yahoogroups.com&gt;\r\nSubject: Ideas\r\nDate: Wed, 7 Mar 2001 13:47:29 -0300\r\nMessage-ID: &lt;GOEBKJJIHMHJNDBCCICDOEIHCGAA.zuk@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook IMO, Build 9.0.2416 (9.0.2910.0)\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4133.2400\r\nIn-Reply-To: &lt;3AA646F75A.FCCCGABRIEL@...&gt;\r\nImportance: Normal\r\nFrom: &quot;Pablo Zuccarino&quot; &lt;zuk@...&gt;\r\n\r\nGente:\n\nComo decia, esto se puso interesante. Demasiado, quizas.\nLlego y tengo 30 mails con exposiciones de la industria, los equipos y ADVA!\nLamentablemente, no me da el tiempo para responder y opinar sobre todo lo\nque me gustaria hacerlo..\nIgual, es bueno que se genere este debate, y estoy seguro que siempre se\nsacan cosas buenas, aunque haya bastante confusion y se necesite un rato\nlargo para leer y responder a todo.\n\nHumildemente, voy a hacer mi contribucion:\n\n1.Industria Nacional\nSi no me equivoco, mas que lograr una &quot;industria Nacional&quot;, lo que todos\nquieren es &quot;vivir de esto&quot; (y lo mejor posible, obvio) y hacer lo que mas\nnos gusta. La industria seria un resultado de esto (una cierta cantidad de\ngente/empresas haciendo esto para &quot;ganarse la vida&quot;, generaria X productos y\npor lo tanto una &quot;industria local&quot;\nPor favor, no confundan Industria con mercado, el mercado local puede ser\ninexistente, pero no tiene porque serlo la industria (por ejemplo, gran\ncantidad de la carne que se produce en la &quot;industria&quot; argentina, no se\nconsume en el &quot;mercado&quot; argentino).\n\nEn esta epoca globalizada, las posibilidades de la industria SI estan ahi.\nY ojo, el mercado tambien esta creciendo... es un error pensar en el mercado\ncomo &quot;Musimundo&quot;, mas alla de que es un key player, HAY otras alternativas\n(no solo empresas, CANALES DE DISTRIBUCION, FORMATOS, etc)\n\nObvio, la &quot;industria&quot; y el &quot;mercado&quot; local se ven afectados por la crisis\n(mundial y especialmente local).\n\n2. Equipos y proyectos de desarrollo\nCuando muchos de la lista hablan de posibles composiciones de equipos,\nvuelvo a ver 2 GRAVES errores, que los proyectos nacionales cometen UNA Y\nOTRA VEZ. Lamentablemente, esos 2 errores terminan siendo el factor\nPRINCIPAL por el cual, MUCHAS veces, sus proyectos fracasan.\nCuales son?\nFaltan 2 &quot;roles&quot; principales (en realidad se desdoblan en muchos, pero para\nsimplificar el analisis, y reflejar un poco mas la &quot;realidad&quot; escasa de\nnuestras posibilidades)\n\n1. GAME DESIGNER: una pieza fundamental del equipo, como puede ser que no se\nlo mencione?????\nSi el programador genera el codigo, el disenador/animador crea graficos, el\nsonido y la musica se componen...\nQUIEN CREEN USTEDES QUE LE DA EL &quot;ALMA&quot; AL JUEGO? no es el guionista, se los\naseguro...\nMucho se puede decir de la funcion del game designer, pero se haria\ndemasiado largo.\nBasicamente, es la persona que &quot;idea&quot; el juego, la que genera el &quot;gameplay -\njugabilidad&quot;, ese &quot;ingrediente invisible&quot; que tantas veces determina el\nexito o FRACASO de un juego.\nUn ejemplo claro: piensen en juegos que son adictivos y divertidos MAS ALLA\ndel aspecto tecnico (programacion/grafico). Eso que hace que los clasicos\n(aun hoy, generaciones y generaciones despues de su lanzamiento) nos sigan\natrapando. Aun sin tener 3D, Sourround, Multibumpingfuckingbliping o lo que\nsea.\nEsta personas, son las que REALMENTE, llevan la experiencia del juego a\nnuestras cabezas.\nSon los que piensan que jugamos, como lo jugamos, que queremos jugar y como\npueden darnos &quot;eso&quot; que nos rompe la cabeza y logra un producto exitoso.\nSon los que tienen que sacar ese &quot;calor&quot; del frio tecnologico (los que sean\ngamers, saben bien que no basta con mil millones de trillones de poligonos\npor segundo para que un juego valga la pena y VENDA... sino preguntenle a\nNintendo: la semana pasada, en un reportaje muy jugoso, su presidente dice\ncosas muy inteligentes y polemicas en relacion a esto)\n\nNo olviden que, mas alla del juego en si, el GAME DESIGNER es el que\ncomienza el proyecto, el que planifica QUE, COMO y PORQUE de los juegos. Y\nesta etapa la saltean??? ERROR AMIGOS\nA decir verdad, la mayoria de los proyectos que yo recibia en EDUSOFT y que\nhe visto en mis anos de experiencia, se pueden clasificar en dos categorias:\n\n1. hice lo que la herramienta me daba (no son juegos, son demos\ntecnologicas, que, por lo general, ni siquiera son &quot;innovaciones&quot; solo son\n&quot;imitaciones)\n\n2. hice lo que a mi me gusta como pude (trato de hacer el &quot;Monkey&quot; Argentino\no el Command n Conquer argentino)\n\nApuntar a las grandes ligas, significa &quot;estar&quot; en las grandes ligas.\nSignifica saber que si hoy &quot;C&conquer&quot; es un exito, el proyecto se empezo\nhace por lo menos 1 ano.\nSignifica que mientras vos estas jugando y copiando cosas, ellos estan en lo\nnuevo (mas alla de que algunas veces se repitan formulas para repetir\ningresos)\n\nEntonces hay que pensar. Saber. Aprender. Leer. Informarse. Pensar de nuevo.\nConocer mis posibilidades, las tendencias, el mercado. Volver a pensar.\nConocer quien tuvo, tiene y va a tener exito. y Porque.\nY pensar de nuevo en lo que quiero hacer.\n\nSi hace 10 anos que un sidescroller 2D de naves no es exito.. porque va a a\nser exito el mio, hecho por 2 pibes sin presupuesto?? No es imposible, pero\nmas valen que tengan una buena razon.\nDisculpen que sea duro, no es personal. Yo tambien cometi este error,\ntratando de hacer un &quot;C&C&quot; Argentino (REGNUM), que salio, incluso sin\nhaberlo alcanzado tecnologicamente, dos anos despues.\nComo puedo pretender tener exito?\n\nTodo esta &quot;reflexion&quot; le cabe al GDesigner. Pero tambien abarca otros\naspectos.\n\nEsto me lleva al otro ROL (que ya se menciono ligeramente):\nMARKETING/NEGOCIOS/PLANEAMIENTO/PRENSA/RELACIONES/CONTACTOS\nLlamenlo como quieran, pero NO LO EVITEN.\n\nO no les parece una coincidencia rara que la queja general del foro es &quot;NO\nNOS COMPRAN LO QUE HACEMOS??&quot;\nEn una economia como la actual, en un mundo y una industria como la actual,\ndejar para lo ultimo este tema es casi suicida...\n\nUstedes saben como son los yanquis con el tema de negocios/marketing, etc\nUstedes saben que Disney te vende, en Neuquen y en Tokyo, un llavero, una\npelicula, un juego y una cancion.\nSon los mejores en esto, y lo aplican a todo lo que hacen.\nYa se, no podemos igualarlos, y quizas no sea el mejor modelo, o el ideal.\nPero es la realidad. Y SE APLICA A TODO. Si, a los JUEGOS TAMBIEN.\n\n3. Posibilidades concretas\nDespues de tanto palo, un poco de oxigeno.\n\nHAY POSIBILIDADES. HAY FORMAS DE HACER ESTO Y HACERLO BIEN, INCLUSO ACA.\nHay gente con talento (en todos los campos), hay ganas, hay pasion, incluso\npuede llegar a haber guita.\nPero las cosas TIENEN QUE SER SERIAS y PROFESIONALES.\nSi quieren solo pasion y ser amateurs, NO LLOREN porque el &quot;mercado les da\nla espalda&quot;\nMe gusto el verso del &quot;hacele el culo&quot;, pero solo me parece una forma\n&quot;guerrillera&quot; de hacerlo.\nEs como seguir en tu posicion equivocada, mas firme y constante, pero\nequivocado al fin.\nSi quieren jugar en la liga, HAY REGLAS QUE CUMPLIR.\nMas alla de toda discusion &quot;etica, moral, ideologica&quot;, HAY REGLAS, y no las\nponemos nosotros.\nPunto.\n\nDecia, antes de volver al sermon, que hay posibilidades.\nProyectos Online (que demandan menos recursos y alcanzan audiencias\nmayores), proyectos para otros segmentos (no todos los juegos tienen que ser\nTriple A, ni todas las peliculas tienen que ser TITANIC), demos para entrar\nen companias que son grandes, Juegos comerciales que &quot;bancan&quot; juegos mas\n&quot;pasionales&quot;, etc.\n\nA riesgo de sonar arrogante, les digo que yo conozco el tema.\nNecesito pagarme el morfi hace bastante tiempo, pero siempre me las ingenie\npara hacer cosas que me gustan, y que son viables economicamente.\nPor eso, pase por todas las veredes: editorial, online, desarrollo,\ndistribucion, exposiciones.. etc.\nLo poco o mucho que aprendi, esta a disposion de todos.\nPero hagamos las cosas bien. No nos garantiza el exito, pero las\nprobabilidades aumentan, se los aseguro.\n\n4. ADVA\nEn cuanto a esto tiro un par de conceptos:\n- basta de vueltas con el logo\n- la pagina y el grupo parece estar bien orientado (asesoramientos, lobby,\ntutoriales, consejos, manejos de prensa, clasificados, oportunidades,\nnoticias, etc)\n- para que se mueva, hay que elegir/designar/sortear alguna especie de\nautoridad, o cargos o un grupo/persona que lidere. Esto es inevitable y\nnecesario para que salga adelante.\n- Tambien creo que ya estamos listos para otra reunion. Somos mas, sabemos\nmas de lo que queremos, y hay cosas para hacer. Como siempre, estan\ninvitados a El Sitio, pero puede ser donde sea y como sea.\n\nBueno, se me fue la mano con la extension del email.\n: )\n\nAhora se me acumularon 78 cosas para hacer, pero espero que de alguna manera\nvalga la pena.\nEscucho sus ideas.\n\nUn abrazo, cuenten conmigo.\n\nPablo Zuccarino\nProductor de Juegos\nEl Sitio, Management\nIngeniero Huergo 1167\nC1107 AOL, Buenos Aires\n54-11-4339-3700\nwww.elsitio.com &lt;http://www.elsitio.com&gt;\nzuk@... &lt;mailto:zuk@...&gt;\n\n\n\n\n\n-----Mensaje original-----\nDe: Gabriel Jacobo [mailto:gabriel@...]\nEnviado el: Wednesday, March 07, 2001 11:35 AM\nPara: JuegosAR@yahoogroups.com\nAsunto: Re: [JuegosAR] Nuevo logo - ADVA\n\n\n&gt; Si, es un CAOS sino.\n&gt;\n&gt; Quien vota para elegir un despota omnipotente de ADVA?\n\nYa vamos mal...el despota tiene que tomar el poder por si mismo, sino es\nun despota democratico...como Menem, bah! :)\n\nGabriel.\n\nPD: Dale vos, Javier...ya te hiciste amigo de Monica y Cesar, todos te\nadmiramos! :)\n\nTo unsubscribe from this group, send an email to:\nJuegosAR-unsubscribe@egroups.com\n\n\n\nYour use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n\n\n"}}