{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Juan Linietsky","from":"Juan Linietsky &lt;coding@...&gt;","replyTo":"LIST","senderId":"WkiXwQIjTeraXsOWFkVth9AXYxAHurAvXOZmguuarkdZCCBCwIpI5MORbx6APbaXsEt2OXcVwqU-sgg-DA5jzDwRp8xOSZCT2HsM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [JuegosAR] Ideas","postDate":"983989103","msgId":468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDMwNzE1MTgyMzAxLjA0NTU1QHNlcnZlcj4=","inReplyToHeader":"PEdPRUJLSkpJSE1ISk5EQkNDSUNET0VJSENHQUEuenVrQGVsc2l0aW8uY29tLmFyPg==","referencesHeader":"PEdPRUJLSkpJSE1ISk5EQkNDSUNET0VJSENHQUEuenVrQGVsc2l0aW8uY29tLmFyPg=="},"prevInTopic":467,"nextInTopic":469,"prevInTime":467,"nextInTime":469,"topicId":444,"numMessagesInTopic":18,"msgSnippet":"... Si es en castellano nadie te impide venderlo en otros paises. ... Y.. si da la calidad.. ... Te estas olvidando de algo.. la mayoria de los juegos hechos","rawEmail":"Return-Path: &lt;coding@...&gt;\r\nX-Sender: coding@...\r\nX-Apparently-To: juegosar@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 7 Mar 2001 18:29:36 -0000\r\nReceived: (qmail 99083 invoked from network); 7 Mar 2001 18:29:36 -0000\r\nReceived: from unknown (10.1.10.142) by l9.egroups.com with QMQP; 7 Mar 2001 18:29:36 -0000\r\nReceived: from unknown (HELO john.anime.com.ar) (199.190.101.216) by mta3 with SMTP; 7 Mar 2001 19:30:40 -0000\r\nReceived: from server (red@... [24.232.17.22]) by john.anime.com.ar (8.9.3/8.9.3) with SMTP id VAA01872 for &lt;juegosar@yahoogroups.com&gt;; Wed, 8 Jan 2003 21:32:51 -0300\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nTo: juegosar@yahoogroups.com\r\nSubject: Re: [JuegosAR] Ideas\r\nDate: Wed, 7 Mar 2001 15:18:23 -0300\r\nX-Mailer: KMail [version 1.2]\r\nReferences: &lt;GOEBKJJIHMHJNDBCCICDOEIHCGAA.zuk@...&gt;\r\nIn-Reply-To: &lt;GOEBKJJIHMHJNDBCCICDOEIHCGAA.zuk@...&gt;\r\nMIME-Version: 1.0\r\nContent-Transfer-Encoding: 8bit\r\nOrganization: CL\r\nMessage-Id: &lt;01030715182301.04555@server&gt;\r\nFrom: Juan Linietsky &lt;coding@...&gt;\r\n\r\nOn Wednesday 07 March 2001 13:47, you wrote:\n&gt; Gente:\n&gt;\n&gt; Como decia, esto se puso interesante. Demasiado, quizas.\n&gt; Llego y tengo 30 mails con exposiciones de la industria, los equipos y\n&gt; ADVA! Lamentablemente, no me da el tiempo para responder y opinar sobre\n&gt; todo lo que me gustaria hacerlo..\n&gt; Igual, es bueno que se genere este debate, y estoy seguro que siempre se\n&gt; sacan cosas buenas, aunque haya bastante confusion y se necesite un rato\n&gt; largo para leer y responder a todo.\n&gt;\n&gt; Humildemente, voy a hacer mi contribucion:\n&gt;\n&gt; 1.Industria Nacional\n&gt; Si no me equivoco, mas que lograr una &quot;industria Nacional&quot;, lo que todos\n&gt; quieren es &quot;vivir de esto&quot; (y lo mejor posible, obvio) y hacer lo que mas\n&gt; nos gusta. La industria seria un resultado de esto (una cierta cantidad de\n&gt; gente/empresas haciendo esto para &quot;ganarse la vida&quot;, generaria X productos\n&gt; y por lo tanto una &quot;industria local&quot;\n&gt; Por favor, no confundan Industria con mercado, el mercado local puede ser\n&gt; inexistente, pero no tiene porque serlo la industria (por ejemplo, gran\n&gt; cantidad de la carne que se produce en la &quot;industria&quot; argentina, no se\n&gt; consume en el &quot;mercado&quot; argentino).\n&gt;\n\nSi es en castellano nadie te impide venderlo en otros paises.\n\n&gt; En esta epoca globalizada, las posibilidades de la industria SI estan ahi.\n&gt; Y ojo, el mercado tambien esta creciendo... es un error pensar en el\n&gt; mercado como &quot;Musimundo&quot;, mas alla de que es un key player, HAY otras\n&gt; alternativas (no solo empresas, CANALES DE DISTRIBUCION, FORMATOS, etc)\n&gt;\n&gt; Obvio, la &quot;industria&quot; y el &quot;mercado&quot; local se ven afectados por la crisis\n&gt; (mundial y especialmente local).\n\nY.. si da la calidad.. \n\n\n&gt; 2. Equipos y proyectos de desarrollo\n&gt; Cuando muchos de la lista hablan de posibles composiciones de equipos,\n&gt; vuelvo a ver 2 GRAVES errores, que los proyectos nacionales cometen UNA Y\n&gt; OTRA VEZ. Lamentablemente, esos 2 errores terminan siendo el factor\n&gt; PRINCIPAL por el cual, MUCHAS veces, sus proyectos fracasan.\n&gt; Cuales son?\n&gt; Faltan 2 &quot;roles&quot; principales (en realidad se desdoblan en muchos, pero para\n&gt; simplificar el analisis, y reflejar un poco mas la &quot;realidad&quot; escasa de\n&gt; nuestras posibilidades)\n&gt;\n&gt; 1. GAME DESIGNER: una pieza fundamental del equipo, como puede ser que no\n&gt; se lo mencione?????\n&gt; Si el programador genera el codigo, el disenador/animador crea graficos, el\n&gt; sonido y la musica se componen...\n\nTe estas olvidando de algo.. la mayoria de los juegos hechos aca surgen como \nproyectos entre varios, asi que tanto el programador, como el artista como el \nmusic tambien van a querer aportar su granito de arena, no te parece?\nLos game designers de verdad tienen que poder\npedirle al programador como tiene que ser la interface al codigo con la que \notros van a trabajar (herramientas de desarrollo), por mas que no sepan\nprogramar. Tienen que tener un poco de idea de que tipo de musica engancha \nen cada lugar, por mas que no sepan componer, y tienen que saber que tipo de \ngraficos se necesitan, y por mas que tampoco sepan dibujar.. necesitan\nuna idea global de todo. es muy complicado... como es el &quot;jefe&quot; de todos\ny no sabe tanto como quienes estan mas abajo..tiene que REALMENTE\nsaber lo que hace para que no lo odien.\n\n\n&gt; Nintendo: la semana pasada, en un reportaje muy jugoso, su presidente dice\n&gt; cosas muy inteligentes y polemicas en relacion a esto)\n&gt;\n\nNintendo tiene a shigeru miyamoto, y ese tipo es el dios del game design,\ndisenia juegos hace 20 anios o mas.\n\n&gt; No olviden que, mas alla del juego en si, el GAME DESIGNER es el que\n&gt; comienza el proyecto, el que planifica QUE, COMO y PORQUE de los juegos. Y\n&gt; esta etapa la saltean??? ERROR AMIGOS\n&gt; A decir verdad, la mayoria de los proyectos que yo recibia en EDUSOFT y que\n&gt; he visto en mis anos de experiencia, se pueden clasificar en dos\n&gt; categorias:\n&gt;\n&gt; 1. hice lo que la herramienta me daba (no son juegos, son demos\n&gt; tecnologicas, que, por lo general, ni siquiera son &quot;innovaciones&quot; solo son\n&gt; &quot;imitaciones)\n&gt;\n&gt; 2. hice lo que a mi me gusta como pude (trato de hacer el &quot;Monkey&quot;\n&gt; Argentino o el Command n Conquer argentino)\n\nbueno.. tampoco vas a estar cambiando todo sobre la marcha,\nno creo que el mas grande problema de las cosas hechas aca sea eso...\nseguro que de disenio sobra antes de empezar a programar, y si queres\nagregarle un chiche u otro mas adelante, no veo el problema.\n\n\n&gt; Todo esta &quot;reflexion&quot; le cabe al GDesigner. Pero tambien abarca otros\n&gt; aspectos.\n&gt;\n&gt; Esto me lleva al otro ROL (que ya se menciono ligeramente):\n&gt; MARKETING/NEGOCIOS/PLANEAMIENTO/PRENSA/RELACIONES/CONTACTOS\n&gt; Llamenlo como quieran, pero NO LO EVITEN.\n&gt;\n\nponelo de esta manera.. cuando empezamos a hacer juegos la mayoria de \nnosotros eramos pibes y no teniamos mucha idea de como funcionaba todo..\nahora estamos todos mas crecidos y ya entendemos mejor como funciona\ntodo esto..\n\n\n&gt; O no les parece una coincidencia rara que la queja general del foro es &quot;NO\n&gt; NOS COMPRAN LO QUE HACEMOS??&quot;\n&gt; En una economia como la actual, en un mundo y una industria como la actual,\n&gt; dejar para lo ultimo este tema es casi suicida...\n\nLo unico que es suicida, creo yo, es apuntar al mercado local, con cosas\nque no llegan a la calidad de las hechas fuera del pais y esperar\nque sea un exito en ventas. El regnum fue el primero juego conocido argentino,\ny no llego muy lejos tampoco...\n\n&gt; Despues de tanto palo, un poco de oxigeno.\n&gt;\n&gt; HAY POSIBILIDADES. HAY FORMAS DE HACER ESTO Y HACERLO BIEN, INCLUSO ACA.\n&gt; Hay gente con talento (en todos los campos), hay ganas, hay pasion, incluso\n&gt; puede llegar a haber guita.\n&gt; Pero las cosas TIENEN QUE SER SERIAS y PROFESIONALES.\n\nEstoy totalmente de acuerdo con vos, pero sabes que? para hacer cosas\nprofesionales necesitas guita.. una oficina, maquinas,  y dinero\npara mentenerte..  sin contar con todos los costos extra.. como pagarle a un \ndiseniador profesional en caso que necesites, pagar por el software original \n(ja ja) de donde viene TODA ESA plata? para un par de pibes que quieren\ndesarrollar un juego.. es un poco imposible no? Si estuvieras en estados\nunidos, conseguir inversiones es una huevada.. pero aca? \nse te cagan de risa.\n\n\n&gt; A riesgo de sonar arrogante, les digo que yo conozco el tema.\n&gt; Necesito pagarme el morfi hace bastante tiempo, pero siempre me las ingenie\n&gt; para hacer cosas que me gustan, y que son viables economicamente.\n&gt; Por eso, pase por todas las veredes: editorial, online, desarrollo,\n&gt; distribucion, exposiciones.. etc.\n&gt; Lo poco o mucho que aprendi, esta a disposion de todos.\n&gt; Pero hagamos las cosas bien. No nos garantiza el exito, pero las\n&gt; probabilidades aumentan, se los aseguro.\n\nMe hace acordar que ahi por el 97 fui a EDUSOFT a\npresentar un juego que habiamos hecho con unos amigos..\nterminaron queriendonos contratar por un plazo de varios\nanios y los mandamos a la mierda.. \nLa cosa es que ahi nos enteramos que &quot;los pibes del regnum&quot;\nestaban haciendo un juego de estrategia para el mercado de estados\nunidos..  nos mostraron algo del arte y imagenes y se veia lindo.. pero al \nfinal que paso con eso? nunca me entere.\n\n\n&gt; 4. ADVA\n&gt; En cuanto a esto tiro un par de conceptos:\n&gt; - basta de vueltas con el logo\n&gt; - la pagina y el grupo parece estar bien orientado (asesoramientos, lobby,\n&gt; tutoriales, consejos, manejos de prensa, clasificados, oportunidades,\n&gt; noticias, etc)\n&gt; - para que se mueva, hay que elegir/designar/sortear alguna especie de\n&gt; autoridad, o cargos o un grupo/persona que lidere. Esto es inevitable y\n&gt; necesario para que salga adelante.\n&gt; - Tambien creo que ya estamos listos para otra reunion. Somos mas, sabemos\n&gt; mas de lo que queremos, y hay cosas para hacer. Como siempre, estan\n&gt; invitados a El Sitio, pero puede ser donde sea y como sea.\n&gt;\n\nMis experiencias previas con el sitio son para nada gratas, pero gracias \nIgual. No le recomendaria a nadie que se meta con el sitio..\nlo unico bueno son las gatas de la planta baja, donde estan los\neditores.\n\n\nJuan Linietsky / Codelarvs.\nhttp://www.codelarvs.com.ar\n\n"}}