{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Foca Clota","from":"Foca Clota &lt;focaclota@...&gt;","replyTo":"LIST","senderId":"WobbeJnb2hFmwoeKbKwufuhMPtV5q5Vevb1ZS057m4x6ourebteVDZ8pkCaCxNC3T-1zWYYBy2VBqm3QiaebfJTqBKVdZlM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Je je je","postDate":"984108971","msgId":522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwMzA5MDMzNjExLjU2NzA0LnFtYWlsQHdlYjk5MDMubWFpbC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":521,"nextInTime":523,"topicId":522,"numMessagesInTopic":1,"msgSnippet":"Bueno, bueno... creo que aca tenemos a un tipo bastante resentido.. claro.. que cagada que no tenga guita, no? porque sino me iba a EEUU y ahi seguro que","rawEmail":"Return-Path: &lt;focaclota@...&gt;\r\nX-Sender: focaclota@...\r\nX-Apparently-To: JuegosAR@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 9 Mar 2001 03:36:12 -0000\r\nReceived: (qmail 47435 invoked from network); 9 Mar 2001 03:36:11 -0000\r\nReceived: from unknown (10.1.10.27) by m8.onelist.org with QMQP; 9 Mar 2001 03:36:11 -0000\r\nReceived: from unknown (HELO web9903.mail.yahoo.com) (216.136.129.246) by mta2 with SMTP; 9 Mar 2001 03:36:11 -0000\r\nMessage-ID: &lt;20010309033611.56704.qmail@...&gt;\r\nReceived: from [64.76.42.78] by web9903.mail.yahoo.com; Thu, 08 Mar 2001 19:36:11 PST\r\nDate: Thu, 8 Mar 2001 19:36:11 -0800 (PST)\r\nSubject: Je je je\r\nTo: JuegosAR@yahoogroups.com\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nFrom: Foca Clota &lt;focaclota@...&gt;\r\n\r\nBueno, bueno... creo que aca tenemos a un tipo\nbastante resentido.. claro.. &#39;que cagada que no tenga\nguita,\nno? porque sino me iba a EEUU y ahi seguro que valoran\nmi gran talento..&#39;  jeje.. si te crees el John Carmack\nargentino, donde carajo esta tu &#39;Quake&#39;?? o es que voy\na tener que aguantar todos tus comentarios del tipo\n&#39;yo = el mas mejor / los demas = inutiles&#39; hasta que\ntermines de programar tu &#39;basura en caja&#39;, si algun\ndia terminas..\n\nQueres hablar sobre el desarrollo?? yo tambien.. como\ndesarrollaste esa autoestima tan grande? quien mierda\nte crees que sos? y ya que hablamos de desarrollo...\ndonde esta tu juego??\n\nRealmente, me gustaria saber tanto como vos.. parece\nque sabes mucho de todo.. (incluso de mi propia\nvida)... lo que mas me gustaria es saber como haces\npara escribir tantas boludeces juntas.. hiciste un\nposgrado en pelotudo o aprendiste solo..?\n\nAh.. y sobre lo de cagarte a trompadas.. parece que ya\nhay mucha gente que te quiere reventar.. y seguro con\nrazon. Pero bueno, como hago? tengo que sacar numero o\nte cago a trompadas de una?\n\n- Royconejo (el que gasta $100 los fines de semana,\nvive en su dpto, y te va a cagar a trompadas).\n\nPd: \nPodes terminar tu gran juego tranquilo, sin mandarte\ntanto la parte, o es mucho pedir?\n\nEspero, por tu bien, y por el bien de la &#39;industria\nargentina&#39;, que tu juego sea un gran exito.. pero si\nno.. vas a entender porque critico tanto tu actitud..\n\n\n\n----- Original Message ----- \nFrom: Javier Cabrera \nTo: JuegosAR@yahoogroups.com \nSent: Thursday, March 08, 2001 1:05 PM\nSubject: Re: [JuegosAR] El Da Vinci Argentino..\n\n\nMira, no ingrese a la lista para discutir con vos, eso\nes seguro. No tengo ganas de crear otro tema que dure\n2 dias al cuete. Prefiero hablar sobre el desarrollo,\nque es lo que a todos nos interesa.\n\nTal vez vivis en tu Dpto, pagado por tu viejo, tenes\nuna mucama, tenes un coche, tenes un perro, tenes\nestudios y la pasas bomba los viernes a la noche\ncuando te vas a bailar y gastas 100 mangos hasta el\nsabado.\nNo digo que este mal, ojala pudiera hacer eso. Pero te\nquiero aclarar algo, y si me corren de la lista, voy a\nconfirmar que los desarrolladores argentinos no tiene\nni la mas minima idea de lo que hacen.\n\nHay gente, como yo y mi hno, que esta mal cagada de\nhambre, solo porque vos tengas plata, o vallas al\nshopping todos los domingos, no quiere decir que toda\nla gente del pais sea asi. O porque tenes seguridad\neconomica. Esto es algo serio de lo que te estoy\nhablando, no te estoy retando ni mucho menos quiero\nofenderte. Solo quiero que trates, de algun modo, solo\no con ayuda, entender; que la gente, no es igual a\nvos. Hay algunos que si, con los que te reuniras y\njugaras a la pelota o un Cs o algo, o saldras a bailar\no en la facultad, pero hay otra que no, como es mi\ncaso.\n\nLo de la colecta, la verdad, me ofendio mucho. Habas\nde esfuerzo para hacer un juego, y no tenes ni la mas\nMINIMA idea de lo que es hacer esfuerzo para poder\nvivir, y DESPUES hacer el juego.\n\nTengo conexion, y PC gracias al trabajo, pero si el,\nsolo tendria un PC (comprada tambien con esfuerzo,\ncuando las cosas no pareciant an mal).\n\n\nTenes que enteder ahora macho, porque si no, despues\nva a ser tarde. Y si luego de escribirte todo esto, de\ndecirte, como es la cosa, salis con una pendejada de\n&quot;chupame un huevo, jajaja, yo tambien hago esfuerzos&quot;\ny no reflecxionas un carajo, creo que para mi y para\nun buen par, no vale la pena seguir en una lista en la\nque la opinion de tipos como vos, es expuesta a todos.\n\n\n\nOjala y tengas una buena vida, y no te haga falta\nnunca nada. De verdad te digo.\n\nNo quiero dar lastima, solo digo como son las cosas.\n\nEn cuanto a NEGRO NEGRO, no se quien conio es y no me\ninteresa. Habla igual que yo, o parecido. Pero no soy\nyo. \n\nEl que me cree, bien por el, el que no, no me\ninteresa.\n\nuna ultima cosa, hubo un comentario sobre &quot; los\nmodedaroes lo tendrian que rajar&quot; o algo asi...\n\nSi me quieren rajar, RAJENME, no interesa en lo mas\nminimo no?\n\nEn cuanto al juego y davinci, si se me fue la mano con\nlas palabras, y alguno se sintio ofendido, me disculpo\ny le toco el culo, porque a mi, los &quot;bocetos a lapiz&quot;\n(en verdad, son en tinta sr. perito en bocetos) y a\nmucha gente, le parecen fantasticos, sobre todo cuando\nse empiezan a mover como Gosht in the Shell.\n\nAsi que ya ven, asi viene la cosa.\nEsos son bocetos, echos hace dos meses, cuando\nprobabamos personajes. Hoy en dia, tenemos como 23\npersonajes, animados y un bue par sin animar.\n\nFondos, tenemos 14.\nNo les vamos a mostrar nada, porque van a empezar a\ndecir &quot; que cagada, tanta cagada para eso &quot; prefiero\nque lo vean en el estante de musimundo. \nAhora viene la polemica de &quot;no va a salir en\nmusimundo, callate, no sabes nada del mercado, yo\nestoy haciendo juegos hace 39 anios y se mas que vos&quot;\n\nBueno, congratulationes, escribite un puto libro y\nvendelo en el colectivo, junto con tu juego. Yo lo voy\na sacar en musimundo. Algun problema? No creen que lo\nvan a aceptar, o nisiquiera mirar, o habra un problema\ncon los desarrolladores de argentina acaso? \nAh, ya se, musimundo les tiene bronca, porque son\nmalos.\n\npst.\n\nahi se ven.\n\ncya.\nJavier Cabrera (alguien dijo que no puse mi nombre en\nun email, ahi tenes)\n\n_________________________________________________________\n\n__________________________________________________\nDo You Yahoo!?\nGet email at your own domain with Yahoo! Mail. \nhttp://personal.mail.yahoo.com/\n\n"}}