{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Alejandro Vairoli","from":"&quot;Alejandro Vairoli&quot; &lt;byalex@...&gt;","replyTo":"LIST","senderId":"WrWSb1ev4Gh6MsxN4m4fpjRYUv2CcogOf8YT_3eDXauFd1eXwZBTvhXV49P_kzOpenp-Hgf3GqIBneMoLNALOiyyMb4-mQ7gSPqq9aSHN90","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [JuegosAR] Porque directX no? (experiencia personal)","postDate":"984448153","msgId":630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE5FQkJKSEJLT0xMQ0VGSkFPS0VGRUVMTkNCQUEuYnlhbGV4QGFybmV0LmNvbS5hcj4=","inReplyToHeader":"PDAxMDMxMjIyMjYyNzA1LjAzMzc2QHNlcnZlcj4="},"prevInTopic":594,"nextInTopic":631,"prevInTime":629,"nextInTime":631,"topicId":571,"numMessagesInTopic":18,"msgSnippet":"Te soy sincero no pude leer completamente tu mail, pero el tema de no desarollar para linux, lo pase por alto por que es obvio, no creo que valga la pena","rawEmail":"Return-Path: &lt;byalex@...&gt;\r\nX-Sender: byalex@...\r\nX-Apparently-To: JuegosAR@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 14 Mar 2001 20:22:47 -0000\r\nReceived: (qmail 2337 invoked from network); 14 Mar 2001 20:17:34 -0000\r\nReceived: from unknown (10.1.10.26) by l10.egroups.com with QMQP; 14 Mar 2001 20:17:34 -0000\r\nReceived: from unknown (HELO smtp1.arnet.com.ar) (200.45.0.12) by mta1 with SMTP; 14 Mar 2001 20:17:31 -0000\r\nReceived: (qmail 24544 invoked from network); 14 Mar 2001 20:04:42 -0000\r\nReceived: AntiBombing Version 0.08 by GCM\r\nReceived: ThePolice Version 0.02 by GCM\r\nReceived: from host000004.arnet.net.ar (HELO mail1.arnet.com.ar) (200.45.0.4) by host000012.arnet.net.ar with SMTP; 14 Mar 2001 20:04:42 -0000\r\nReceived: from mail pickup service by mail1.arnet.com.ar with Microsoft SMTPSVC; Wed, 14 Mar 2001 17:04:28 -0300\r\nReceived: from bypc ([200.45.100.15]) by mail1.arnet.com.ar  with Microsoft SMTPSVC(5.5.1877.357.35); Mon, 12 Mar 2001 22:51:24 -0300\r\nTo: &lt;JuegosAR@yahoogroups.com&gt;\r\nSubject: RE: [JuegosAR] Porque directX no? (experiencia personal)\r\nDate: Mon, 12 Mar 2001 22:49:13 -0300\r\nMessage-ID: &lt;NEBBJHBKOLLCEFJAOKEFEELNCBAA.byalex@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook IMO, Build 9.0.2416 (9.0.2910.0)\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4133.2400\r\nIn-Reply-To: &lt;01031222262705.03376@server&gt;\r\nImportance: Normal\r\nReturn-Path: byalex@...\r\nFrom: &quot;Alejandro Vairoli&quot; &lt;byalex@...&gt;\r\n\r\n\tTe soy sincero no pude leer completamente tu mail, pero el tema de no\ndesarollar para linux, lo pase por alto por que es obvio, no creo que valga\nla pena mencionarlo.\n\tSeguramente como yo y vos somo unos BURROS comparado con los que manejan\nesta industria (se nota perfectamente por esta especie de discucion) y el\n90% elige la plataforma en que desarrolla por motivos que seguramente nos\ncostaria entender, y como decia un profe mio, aprovecha las desiciones de la\ngente que ya recorrio el camino que vos queres recorrer y que tomaron por\nmotivos que talvez hoy no podamos entender, no gastes tu tiempo en cosas ya\ndefinidas.\n\tEntonces la discucion no es &quot;LAS APIS ni COMO FUNCIONAN&quot; son cosas que\ndamos por descontadas por que todos las conocemos y son triviales, la\neleccion se basa en problemas de mercado y de desarrollo.\n\n\tY no leas todo linealmente sino tratalo de comprender vas a ver que hay mas\ncontenido de los que tus ojos pueden ver.\n\ny por favor no hagamos de este tema secundario, un gastadero de tiempo, que\nesta discucion ya la hemos tenido cuando eramos mas chicos y desconociamos\nla importancia real de las cosas.\n\nUn gran abrazo.\nbyalex\n\n-----Mensaje original-----\nDe: Juan Linietsky [mailto:coding@...]\nEnviado el: Lunes, 12 de Marzo de 2001 22:26\nPara: JuegosAR@yahoogroups.com\nAsunto: Re: [JuegosAR] Porque directX no? (experiencia personal)\n\n\nOn Monday 12 March 2001 20:25, Alejandro Vairoli wrote:\n\nEstas un poco desactualizado... voy a tratar de ayudarte\n\n&gt; Por el tema del Api, yo tambien programe desde la Spectrum en Z80, luego\nen\n&gt; 8086, arme mis propias interrupciones e inclusive programe un driver\n&gt; residente de sonido para parlante, y me encantaba DOS, pero el tiempo pasa\n&gt; y debemos actualizarnos, y lamentablemente todo lo que digan de cualquier\n&gt; API es discutible y casi todas son muy buenas cada una en su area, pero no\n&gt; podemos desconocer algo que talvez sea lo mas importante.... si no\nvendemos\n&gt; lo que hacemos.... no podemos seguir haciendolo, y le busques la vuelta\nque\n&gt; le busques, los juegos funcionan en Windows y por mas que Linux sea genial\n&gt; y muy bueno y todos los chiches que les pongas, el mercado no va a cambiar\n&gt; del dia a la noche, y hoy por hoy la mejor (SINO EN LA PRACTICA CASI LA\n&gt; UNICA) es DirectX.\n\nuhm..  alguna vez hable de desarrollar PARA linux? me parece que no me\nleiste\nbien. Una cosa es desarrollar PARA linux y otra desarrollar BAJO linux.\nDe lo unico que hable es codigo portable.\nBueno.. voy a tratar de informarte un poco en el tema.\n\nCada sistema operativo tiene su(s) API(s) grafica(s)\n\nMac tiene la suya (ni idea, nunca programe en mac)\nUnix tiene X/Xv/DGA (esto se aplica a Linux/BSD/IRIX/Solaris y lo que\nquieras)\nWindows tiene DirectDraw y GDI.\n\nahora..  si sobre esas apis se usan wrappers que te dan la funcionalidad\nnecesaria, y te aseguran que funcionan en cualquier sistema operativo\nexistente de la actualidad.. creo que ahi tenes una ventaja..\nel mejor ejemplo es SDL ( http://www.libsdl.org ) que es tan grosa\nque se portaron montones de juegoes existentes a linux y otras\nplataformas usandola ( anda a http://www.lokigames.com -&gt; products y mira)\nSDL es un wrapper, no OTRA libreria. funcina por arriba de directx o GDI\nen windows, y arriba de X/Xv/DGA en unix.... entonces.. podes programar\ntu juego usando linux/beos o lo que quieras.. que es un ambiente\nmas productivo (mas estable, mas seguro, muchisimo mejores herramientas\nde desarrollo)  y despues vas a windows y compilas tu mismo codigo y\nmagicamente funciona perfecto.. despues.. vas a una mac.. y compilas\ntu codigo y magicamente funciona perfecto.. vas a linux. o BSD.. y compilas\ntu codigo y magicamente funciona perfecto.. vas a una SGI.. y compilas\ny magicamente funciona perfecto.. no es maravilloso? y vos no moviste un\ndedo.\nTe beneficias vos y beneficias a los otros.\n\nAhora por el otro lado.. haces todo en directx, te cuesta mucho mas y te\nvolves cada vez mas dependiente de la api de microsoft.. te tenes\nque bancar el modelo COM y todos los miles de inconvenientes de la api,\naprenderte todas las maneras de hacer workarounds a los problemas..\ndespues queres portar tu codigo a MAC o a otro lado... no.. olvidate.\npara que tomarse el laburo si total windows es que mas se usa no?\nes un poco un circulo vicioso..\n\nVos me hablas del mercado? yo te digo que no. Acaso vos haces juegos con\nel unico proposito de ganar guita? debes ser uno de pos pocos,\nsino el unico en esta lista.. podrias haber estudiado una carrera\nde economia y hubieras ganado no sabes como.\nY si tenes una familia que mantener..  no se que haces programando juegos\nentonces.\n\n\n&gt; \tDebo confesar que hice muchas cosas en OpenGl y me gusta mucho, pero\nsigue\n&gt; siendo de la escuela de C y no C++, y esa quizas sea la primer contra\n&gt; importante,\n\nLa maravilla de las apis hechas en C es que son recontra sencillas y muy\nabstraibles.. si buscaras un poco siquiera en yahoo o google encontrarias\nalguna abstraccion de openGL a C++.. si es que SGI no hizo una ya...\n\n&gt;ademas de contar con MUY pocas actualizaciones.\n\ncomo dije antes.. para que queres las actualizaciones? para que te agreguen\nchiches y peloduteces inutiles? OpenGL tiene extensiones.. para eso estan.\n\n&gt; ... Si ya todos dabemos que Carmack, eligio OpenGl y es motivo suficiente\n&gt; para que uno tambien lo elija, pero no olviden que la idea principal de\n&gt; Carmack sigue siendo hacer ENGINES y no JUEGOS.... o acaso que fue Q3A ??\n\nvos haces un juego en C++ y no lo pensas en forma de un engine?\nme daria miedo ver tu codigo. Que el tipo lo haga muy bien y despues\nlo quiera licensiar para su uso... bueno.. es un capo. Que acaso el unreal\ntournament no se licensia como engine? conoces otro juego de ese tipo\nque exista y no se licensie como engine? y eso que el Unreal Tournament\nes api-independiente con drivers para software/OpenGL/Direct3D y Glide.\n\n&gt; \tAdemas y como la cereza del postre si hablamos de portabilidad.....\n&gt; tenemos la posibilidad futura mas viable de todas XBOX.\n\nPrimero y principal... alguna vez viste un juego de PC que se haya portado\na una consola y haya quedado bien, y que valga la pena jugarlo en consola\ny no en PC? es muy dificil! En la PC tenes tu monitor de alta definicion, el\nsupercomodo teclado y el mouse. para que te vas a tener\nque gastar con un televisor y un joystick de un par de botones?\nLos juegos de consola ya tienen la interface pensada para jugar comodamente\nen un sillon o en el piso apretando un par de botones en el joystick.\nNunca quedo bien portar los juegos PC -&gt; Consola, estan\npensados para ser diferentes entornos desde el principio.\nTe parece que podes jugar algo como el Quake, el Planescape, un simulador\nde vuelo o algo asi en una consola? seguro que si, pero te vas a sentir\nrecontra limitado... por el otro lado..  podes en PC jugar juegos de lucha,\no\nde deportes o con varios amigos a la vez comodamente y sin tener que montar\nuna LAN? Estan pensadas para cosas distintas.. portar a XBOX no es tan\nfacil como pensas.. no por la parte tecnica sino porque tenes que repensar\nla interface de tu juego.\nEl Xbox es muy controversial. porque microsoft quiere que tenga todas las\ncosas de una PC, pero que no se parezca a una PC (deci que le sacaron el\npuerto USB.. sino quien sabe que se hubiera podido hacer).. quieren que\nuse los juegos de PC, pero que no sea una PC..  No se sabe mucho\nque va a quedar.. Mas parece un intento de monopolizar el mercado de\nlas consolas que otra cosa.\n\nSegundo.. en el tema tecnico.. el XBox internamente es una simple PC\nPentium III-733 y usa una version reducida del win2k+DirectX..\nnada te impide meterle OpenGL o usar SDL.\n\n&gt; \tSeamos realistas y leamos el Mercado (que de eso queremos vivir NO ?),\npor\n&gt; mas que para muchos, Linux sea como una especie de Religion... nada tiene\n&gt; que ver con la realidad de los juegos hoy en dia.\n&gt;\n\nUna cosa es Leer el mercado y otra programar como programan\nla mayoria de los que estan en el mercado.  Yo simplemente\nestoy diciendo que hay mejores maneras que rompiendose la\ncabeza con apis horrendas y diseniadas por gente\nuna compania sin siquiera experiencia previa en el tema.\n\nLinux ya dista de ser una especie de religion.. como cuando los\nscript kiddies lo usaban nada mas para entrar a internet\ny exploitear otras maquinas con pelotudeces que encontraban\nen listas y sitios dedicados a seguridad.. ademas h48L4b4n 70d0 4Si\n3n L3ngU4G3 l33tSp34k. (lo que los incautos llaman &quot;hackers&quot;)\nEs un sistema operativo completo con cientos de aplicaciones de todo rango,\ncapaz de hacer cualquier cosa que hace windows o MacOS y mucho mas,\nademas de soportar casi cualquier hardware en existencia. Creeme que\nun programador o sysadmin de unix gana muchisimo mas que cualquier\nprogramador de visual basic y te lo digo por experiencia propia..\nporque de esto hice mi laburo.\n\nAsi que antes de dar opiniones tan fuera de lugar, informate un poco.\n\n\n--\nJuan Linietsky/Codelarvs\nhttp://www.codelarvs.com.ar\n\n\nTo unsubscribe from this group, send an email to:\nJuegosAR-unsubscribe@egroups.com\n\n\n\nYour use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n"}}