{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":3628932,"authorName":"Fernando Salas","from":"&quot;Fernando Salas&quot; &lt;fsalas@...&gt;","profile":"fsalastaxo","replyTo":"LIST","senderId":"VxY_dwXCNDi0SBVDiWYNKU7sItxfvU8dDTYdcd3j7_RT0rQag9rhU1-bRaCbbkw1UUSKxj753gDMvHljVDRHt3L47nsvNPJdSp3fSJ1IrMk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Negocios y Etica, la lista, una opinion","postDate":"1039788207","msgId":6743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMmMwMWMyYTJiMCQ2OTYzMTQ4MCQwNTAwYThjMEBjaXByZXM+"},"prevInTopic":0,"nextInTopic":6745,"prevInTime":6742,"nextInTime":6744,"topicId":6743,"numMessagesInTopic":3,"msgSnippet":"Bueno, antes que nada quiero decir que voy a hablar en general sobre hechos y conceptos y no sobre presonas, primero porque no las conozco profundamente y","rawEmail":"Return-Path: &lt;fsalas@...&gt;\r\nX-Sender: fsalas@...\r\nX-Apparently-To: JuegosAR@...\r\nReceived: (EGP: mail-8_2_3_0); 13 Dec 2002 14:03:25 -0000\r\nReceived: (qmail 21045 invoked from network); 13 Dec 2002 14:03:23 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m9.grp.scd.yahoo.com with QMQP; 13 Dec 2002 14:03:23 -0000\r\nReceived: from unknown (HELO mail.fibertel.com.ar) (24.232.0.78)\n  by mta3.grp.scd.yahoo.com with SMTP; 13 Dec 2002 14:03:23 -0000\r\nReceived: from cipres (24.232.33.60) by mail.fibertel.com.ar (5.5.034) (authenticated as fsalas@...)\n        id 3DF8F0BA00025CCD for JuegosAR@...; Fri, 13 Dec 2002 11:03:29 -0300\r\nMessage-ID: &lt;012c01c2a2b0$69631480$0500a8c0@cipres&gt;\r\nTo: &lt;JuegosAR@...&gt;\r\nSubject: Negocios y Etica, la lista, una opinion\r\nDate: Fri, 13 Dec 2002 11:03:27 -0300\r\nMIME-Version: 1.0\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;----=_NextPart_000_0129_01C2A297.4387A640&quot;\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 6.00.2800.1106\r\nX-MIMEOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nFrom: &quot;Fernando Salas&quot; &lt;fsalas@...&gt;\r\nX-Yahoo-Group-Post: member; u=3628932\r\nX-Yahoo-Profile: fsalastaxo\r\n\r\n\r\n------=_NextPart_000_0129_01C2A297.4387A640\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBueno, antes que nada quiero decir que voy a hablar en general sobre hechos=\r\n y conceptos y no sobre presonas, primero porque no las conozco profundamen=\r\nte y segundo porque creo que es mas util. Ademas lo que escribo es solo mi =\r\nopinion basada en mis valores como persona y en mi experiencia profesional.=\r\n\n\nMe parece importante discutir sobre lo que se estuvo hablando en la lista=\r\n estos ultimos dias, se llegaron a poner cosas como:\n\n&quot;De hecho creo que de=\r\n eso se trata, y si usamos a alguien para nuestro beneficio, te pensas que =\r\nese alguien se deja usar porque si????... uno recibe lo que da y el otro da=\r\n porque sabe que el d=EDa de ma=F1ana puede recibir (y no hablo de sexo acl=\r\naro) :) &quot;\n&quot;Creo que entendiste bien y de hecho por suerte era lo que yo esp=\r\neraba de la lista (sacando algunos comentarios fuera de lugar que suelo ign=\r\norar directamente), =BFacaso buscabas otra cosa?&quot;\n\nBueno, yo estoy totalmen=\r\nte en desacuerdo con esta postura, y pensar asi me parece ser completamente=\r\n cinico. Ademas que si bien puede llevar temporalmente a algun beneficio co=\r\nmercial en el corto plazo, es perjudicial tanto como persona, y en mi opini=\r\non comercialmente tambien en el largo plazo. Una cosa es que alguien cooper=\r\ne con la lista y que ese alguien tenga la &quot;espectativa&quot; de que la lista va =\r\na cooperar con el y otra muy pero muy distinta es usar a las personas. De t=\r\nodas formas que alguien se una y coopere con la lista no implica que quiera=\r\n sacar provecho a su vez de la misma, hay siempre ayuda desinteresada de al=\r\ngunas personas que ademas pueden ser ingenuos y verse luego &quot;usados&quot;, lo cu=\r\nal me parece lamentable.\n\nCreo que en la lista hay de todo los tipos de per=\r\nsonas, desde los ingenuos pasando por lo que aportan  desinteresadamente y =\r\naquellos que quieren algo a cambio , terminando en los que simplemente quie=\r\nren usar la lista y sacar provecho propio sin aportar nada.\n\nRespecto de lo=\r\n que se espera de la lista, yo espero otra cosa de la lista, no un conjunto=\r\n de tiburones donde el mas grande o piola se desayuna a los otros. Creo que=\r\n hay que madurar en eso, es uno de los problemas que tenemos los Argentinos=\r\n, siempre queriendo sacar ventaja.\nYo como algo primordial espero colaborac=\r\nion desinteresada en la lista, es algo basico, simplemente espero eso porqu=\r\ne es lo mejor para todos, primero y mas importante como personas y luego mu=\r\ncho menos importante como negocio. Nunca colaboraron con alguien sin espera=\r\nr algo a cambio, yo si, algunas veces, incluso dando codigo que me llevo ho=\r\nras hacer, y hay otros en la lista que tambien, a todos nos consta, me vien=\r\ne a la mente Hernan con todos sus wrappers e informacion en su sitio, y sab=\r\nen que, una de las veces me llego un mail de agradecimiento tan profundo de=\r\n la persona(que no conozco ni es de la lista ni nada) que me alegro la sema=\r\nna, seguramente al tipo le represento mucho, y yo cuando lo ayude sabia que=\r\n era muy remota la posibilidad de que el me pudiera ayudar a mi, que soy un=\r\n nabo por ayudar sin esperar algo a cambio?, no lo creo, queda en cada uno =\r\nreflexionar y pensar que quiere para su vida y su persona.... \nYo entiendo =\r\nque un grupo no quiera entregar ese engine que le llevo un gran esfuerzo gr=\r\natuitamente a la competencia, eso es razonable, ahora si alguien de la comp=\r\netencia pregunta, como implementaste tal cosa en tu motor? donde esa cosa q=\r\nuizas es el 5% del motor, me parece razonable contestarlo, honestamente y s=\r\nin esperar nada a cambio, porque nos beneficia en lo personal como persona,=\r\n y en lo grupal nos permite crecer. De la misama forma hay miles de formas =\r\nde colaborar, con confianza pero sin dejarse usar, asi me manejo yo, y creo=\r\n que es lo mejor(Eso obviamente llevo a que alguna vez fuera el ingenuo al =\r\nque han usado, pero alguien puede usarme solo una vez, eso se los aseguro, =\r\naun asi sigo ayudando cuando puedo).\n\nSacar ventaja,el mundo se dio cuenta =\r\nque hay otras formas, y de hecho eso cambio la forma de negociar. Si ustede=\r\nn estudian la historia de la negociacion van a ver que los conceptos cambia=\r\nron, antes cuando alguien iba a negociar iba a ver que le &quot;sacaba&quot; al otro,=\r\n cada uno trataba de llevar agua a su molino. Hoy en dia se han dado cuenta=\r\n que es mucho mejor negociar a ver de que forma &quot;ambos&quot; llevamos mas agua a=\r\n nuestros molinos o si nos conviene tener un molino compartido entre los do=\r\ns con toda el agua disponible, es un paso de maduracion donde el egoismo ci=\r\nego y la avaricia dan lugar a otras formas de ver las cosas donde no me ben=\r\neficio a costa del otro(eso es usar a una persona) sino que nos beneficiamo=\r\ns ambos.\n\nEs lo mismo que se ve en el laburo, tenes los jefes que mantienen=\r\n a los empleados a su cargo cortitos, y prefieren que sean soldados, no vay=\r\na a ser que alguno &quot; le haga sombra y le mueva el piso &quot;, en cambio hay otr=\r\nos que dicen &quot;cuanto mas suban mis empleados en ideas eficiencia y visibili=\r\ndad, mas subo yo porque me empujan hacia arriba&quot;. O cuando tenes un emplead=\r\no que es un genio y le pagas como al otro que es del monton, total es confi=\r\nado y no se da cuenta, no vaya a ser que ganemos un poquito menos, la clave=\r\n en todo esto es &quot; balance&quot; el due=F1o tiene que ganar y los empleados tien=\r\nen que ganar, todo razonablemente, primero porque es lo que corresponde eti=\r\ncamente y segundo ya que sino en el mediano o largo plazo la cosa se vuelve=\r\n inviable y se desintegra tan simple como eso(El mejor empleado se termina =\r\nyendo ya las puteadas cuando finalmente se da cuenta que lo estaban cagando=\r\n y te quedas con los mediocres), por eso digo que aun en lo comercial el ca=\r\nmino de la etica y los valores es beneficioso. \n\nEn esta lista hay personas=\r\n que tienen que aprender  que lo que se puede hacer un grupo de personas en=\r\n conjunto es mas grande que la suma de lo que puede hacer cada persona por =\r\nseparado , y lo mismo pasa con los grupos, un conjunto de grupos podra hace=\r\nr mas para cada uno si &quot;cooperan&quot; que la suma de lo que pueden hacer indivu=\r\nalmente, mezquinar cosas, o tratar de usar a otros es justamente lo contrar=\r\nio, nadie dice que hay qe dar todo, pero tampoco hay que tratar de sacar ve=\r\nntaja, una relacion con confianza y desinteres, o interes bienintencionado =\r\nnos va a llevar mucho mas lejos que siendo tiburones. Ya lo dice el dicho &quot;=\r\nCria cuervos y te sacaran los ojos&quot;\n\nParece que la palabra etica ha desapar=\r\necido de las actitudes de algunas personas, la &quot;palabra&quot;, la &quot;confianza&quot; y =\r\nla &quot;etica en general&quot; son valores que hay que defender porque si perdemos e=\r\nso, el resto carece de importancia.\n\nFer\r\n------=_NextPart_000_0129_01C2A297.4387A640\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3Diso-8859-1=\r\n&quot;&gt;\n&lt;META content=3D&quot;MSHTML 6.00.2800.1126&quot; name=3DGENERATOR&gt;\n&lt;STYLE&gt;&lt;/STYLE=\r\n&gt;\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Bueno, =\r\nantes que nada quiero decir que voy a hablar \nen general sobre hechos y con=\r\nceptos y no sobre presonas, primero porque no las \nconozco profundamente y =\r\nsegundo porque creo que es mas util. Ademas lo que \nescribo es solo mi opin=\r\nion basada en mis valores como persona y en mi \nexperiencia profesional.&lt;/F=\r\nONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT =\r\nface=3DArial size=3D2&gt;Me parece importante discutir sobre lo que se \nestuvo=\r\n hablando en la lista estos ultimos dias, se llegaron a poner cosas \ncomo:&lt;=\r\n/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPA=\r\nN style=3D&quot;FONT-SIZE: 10pt; COLOR: navy; FONT-FAMILY: Arial&quot;&gt;&quot;De hecho \ncre=\r\no que de eso se trata, y si usamos a alguien para nuestro beneficio, te &lt;SP=\r\nAN \nclass=3DSpellE&gt;pensas&lt;/SPAN&gt; que ese alguien se deja usar porque si&lt;SPA=\r\nN \nclass=3DGramE&gt;????&lt;/SPAN&gt;... uno recibe lo que da y el otro da porque sa=\r\nbe que el \nd=EDa de ma=F1ana puede recibir (y no hablo de sexo aclaro) :) &quot;=\r\n&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;SPAN style=3D&quot;FONT-SIZE: 10pt; COLOR: navy; FONT-FAMILY=\r\n: Arial&quot;&gt;&lt;SPAN \nstyle=3D&quot;FONT-SIZE: 10pt; COLOR: navy; FONT-FAMILY: Arial&quot;&gt;=\r\n&quot;Creo que entendiste \nbien y de hecho por suerte era lo que yo esperaba de =\r\nla lista (sacando algunos \ncomentarios fuera de lugar que suelo ignorar dir=\r\nectamente), =BFacaso buscabas otra \ncosa?&quot;&lt;?xml:namespace prefix =3D o ns =\r\n=3D &quot;urn:schemas-microsoft-com:office:office&quot; \n/&gt;&lt;o:p&gt;&lt;/o:p&gt;&lt;/SPAN&gt;&lt;o:p&gt;&lt;/o=\r\n:p&gt;&lt;/SPAN&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;=\r\n&lt;FONT face=3DArial size=3D2&gt;Bueno, yo estoy totalmente en desacuerdo con es=\r\nta \npostura, y pensar asi me parece ser completamente cinico. Ademas que si=\r\n bien \npuede llevar temporalmente a algun beneficio comercial en el corto \n=\r\nplazo,&nbsp;es perjudicial tanto como persona, y en mi opinion comercialmen=\r\nte \ntambien en el largo plazo. Una cosa es que&nbsp;alguien coopere con la =\r\nlista y \nque ese alguien tenga la &quot;espectativa&quot; de que la lista va a cooper=\r\nar con&nbsp;el \ny otra muy pero muy distinta es usar a las personas. De tod=\r\nas formas que alguien \nse una y coopere con la lista no implica que quiera =\r\nsacar provecho a su vez de \nla misma, hay siempre ayuda desinteresada de al=\r\ngunas personas que&nbsp;ademas \npueden ser&nbsp;ingenuos y verse luego &quot;usa=\r\ndos&quot;, lo cual me parece \nlamentable.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial s=\r\nize=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Creo que en la=\r\n lista hay de todo los tipos de \npersonas, desde los ingenuos pasando por l=\r\no que aportan&nbsp; desinteresadamente \ny aquellos que quieren algo a cambi=\r\no , terminando en los que simplemente quieren \nusar la lista y sacar provec=\r\nho propio sin aportar nada.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;=\r\n/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Respecto de lo que se e=\r\nspera de la lista, yo espero \notra cosa de la lista, no un conjunto de tibu=\r\nrones donde el mas grande o piola \nse desayuna a los otros. Creo que hay qu=\r\ne madurar en eso, es uno de los \nproblemas que tenemos los Argentinos, siem=\r\npre queriendo sacar \nventaja.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2=\r\n&gt;Yo como algo primordial espero colaboracion \ndesinteresada en la lista, es=\r\n algo basico, simplemente espero eso porque es lo \nmejor para todos, primer=\r\no y mas importante como personas y luego mucho menos \nimportante como negoc=\r\nio. Nunca colaboraron con alguien sin esperar algo a \ncambio, yo si, alguna=\r\ns veces, incluso dando codigo que me llevo horas hacer, y \nhay otros en la =\r\nlista que tambien, a todos nos consta, me viene a la mente \nHernan con todo=\r\ns sus wrappers e informacion en su sitio, y saben que, una de las \nveces me=\r\n llego un mail&nbsp;de agradecimiento tan profundo de la persona(que no \nco=\r\nnozco ni es de la lista ni nada) que me alegro la semana, seguramente al ti=\r\npo \nle represento mucho, y yo cuando lo ayude sabia que era muy remota la \n=\r\nposibilidad de que el me pudiera ayudar a mi, que soy un nabo por ayudar si=\r\nn \nesperar algo a cambio?, no lo creo, queda en cada uno reflexionar y pens=\r\nar que \nquiere para su vida y su persona.... &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;Yo entiendo que un grupo no quiera \nentregar&nbsp;ese eng=\r\nine&nbsp;que le llevo un gran esfuerzo gratuitamente a la \ncompetencia, eso=\r\n es razonable, ahora si alguien de la competencia pregunta, como \nimplement=\r\naste tal cosa en tu motor? donde esa cosa quizas es el 5% del motor, me \npa=\r\nrece razonable contestarlo, honestamente y sin esperar nada a cambio, porqu=\r\ne \nnos beneficia en lo personal como persona, y en lo grupal nos permite cr=\r\necer. De \nla misama forma hay miles de formas de colaborar, con confianza p=\r\nero sin dejarse \nusar, asi me manejo yo, y creo que es lo mejor(Eso obviame=\r\nnte llevo a que alguna \nvez fuera el ingenuo al que han usado, pero alguien=\r\n puede usarme solo una vez, \neso se los aseguro, aun asi sigo ayudando cuan=\r\ndo puedo).&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV=\r\n&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Sacar ventaja,el mundo se dio cuenta que=\r\n hay otras \nformas, y de hecho eso cambio la forma de negociar. Si usteden =\r\nestudian la \nhistoria de la negociacion van a ver que los conceptos cambiar=\r\non, antes cuando \nalguien iba a negociar iba a ver que le &quot;sacaba&quot; al otro,=\r\n cada uno trataba de \nllevar agua a su molino. Hoy en dia se han dado cuent=\r\na que es mucho mejor \nnegociar a ver de que forma &quot;ambos&quot; llevamos mas agua=\r\n a nuestros molinos o si \nnos conviene tener un molino compartido entre los=\r\n dos con toda el agua \ndisponible, es un paso de maduracion donde el egoism=\r\no ciego y la avaricia dan \nlugar a otras formas de ver las cosas donde no m=\r\ne beneficio a costa del otro(eso \nes usar a una persona) sino que nos benef=\r\niciamos ambos.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;\n&lt;DIV&gt;&lt;FONT fa=\r\nce=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Es=\r\n lo mismo que se ve en el laburo, tenes los jefes \nque mantienen a los empl=\r\neados a su cargo cortitos, y prefieren que sean \nsoldados, no vaya a ser qu=\r\ne alguno &quot; le haga sombra y le mueva el piso &quot;, en \ncambio hay otros que di=\r\ncen &quot;cuanto mas suban mis empleados en ideas eficiencia y \nvisibilidad, mas=\r\n subo yo porque me empujan hacia arriba&quot;. O cuando&nbsp;tenes un \nempleado =\r\nque es un genio y le pagas como al otro que es del monton, total es \nconfia=\r\ndo y no se da cuenta, no vaya a ser que ganemos un poquito menos, la clave =\r\n\nen todo esto es &quot; balance&quot; el due=F1o tiene que ganar y los empleados tien=\r\nen que \nganar, todo razonablemente, primero&nbsp;porque es lo que correspon=\r\nde eticamente \ny segundo&nbsp;ya que sino en el mediano o largo plazo la co=\r\nsa se vuelve \ninviable y se desintegra tan simple como eso(El mejor emplead=\r\no se termina yendo \nya las puteadas cuando finalmente se da cuenta que lo e=\r\nstaban cagando y te \nquedas con los mediocres), por eso digo que aun en lo =\r\ncomercial el camino de la \netica y los valores es beneficioso. &lt;/FONT&gt;&lt;/DIV=\r\n&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;F=\r\nONT face=3DArial size=3D2&gt;En esta lista hay personas que tienen que \naprend=\r\ner&nbsp; que lo que se puede hacer un grupo de personas en conjunto es mas =\r\n\ngrande que la suma de lo que puede hacer cada persona por separado , y lo =\r\nmismo \npasa con los grupos, un conjunto de grupos podra hacer mas para cada=\r\n uno si \n&quot;cooperan&quot; que la suma de lo que pueden hacer indivualmente, mezqu=\r\ninar cosas, o \ntratar de usar a otros es justamente lo contrario, nadie dic=\r\ne que hay qe dar \ntodo, pero tampoco hay que tratar de sacar ventaja, una r=\r\nelacion con confianza y \ndesinteres, o interes bienintencionado nos va a ll=\r\nevar mucho mas lejos que \nsiendo tiburones. Ya lo dice el dicho &quot;Cria cuerv=\r\nos y te sacaran los \nojos&quot;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/=\r\nFONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial=\r\n size=3D2&gt;Parece que la palabra etica ha desaparecido de las \nactitudes de =\r\nalgunas personas, la &quot;palabra&quot;, la &quot;confianza&quot; y la &quot;etica en \ngeneral&quot; son=\r\n valores que hay que defender porque si perdemos eso, el resto \ncarece de i=\r\nmportancia.&lt;/FONT&gt;&lt;/DIV&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FO=\r\nNT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Fer&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/H=\r\nTML&gt;\n\r\n------=_NextPart_000_0129_01C2A297.4387A640--\r\n\n"}}