{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":63432839,"authorName":"Juan Linietsky","from":"Juan Linietsky &lt;coding@...&gt;","replyTo":"LIST","senderId":"3l9egnYMyGytGuN64t8ZNM4Cx80vjvlFaSAfDr9_cF8EKbw4ijJWFkjw6oB_YbzavPMZdENd7tZjy9rEumAb3Oar1QPeS3gg6ROX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [ADVA] No tenemos porque hacer las cosas como la competencia.","postDate":"1047779612","msgId":7207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzE1MjI1MzMyLjQ2MzhkMTlkLmNvZGluZ0ByZWR1ei5jb20uYXI+","inReplyToHeader":"PEhLRUhMR05HQUZNQkpITUpHQU5MQUVQT0NEQUEubXVncmUyNUBmaWJlcnRlbC5jb20uYXI+","referencesHeader":"PDAwMGIwMWMyZWI0ZCQ5ZjE3MmFlMCQ1M2IyMjhjOEBmZHNwPgk8SEtFSExHTkdBRk1CSkhNSkdBTkxBRVBPQ0RBQS5tdWdyZTI1QGZpYmVydGVsLmNvbS5hcj4="},"prevInTopic":7203,"nextInTopic":7213,"prevInTime":7206,"nextInTime":7208,"topicId":7201,"numMessagesInTopic":15,"msgSnippet":"On Sat, 15 Mar 2003 21:55:40 -0300 ... Hay factores con los que no cuentan sobre el desarrollo de juegos en el pais, principalmente la experiencia.  Aca NADIE","rawEmail":"Return-Path: &lt;coding@...&gt;\r\nX-Sender: coding@...\r\nX-Apparently-To: JuegosAR@...\r\nReceived: (EGP: mail-8_2_6_1); 16 Mar 2003 01:49:59 -0000\r\nReceived: (qmail 8466 invoked from network); 16 Mar 2003 01:49:59 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m6.grp.scd.yahoo.com with QMQP; 16 Mar 2003 01:49:59 -0000\r\nReceived: from unknown (HELO john.anime.com.ar) (64.113.39.216)\n  by mta1.grp.scd.yahoo.com with SMTP; 16 Mar 2003 01:49:59 -0000\r\nReceived: from localhost (OL110-150.fibertel.com.ar [24.232.150.110])\n\tby john.anime.com.ar (8.9.3/8.9.3) with SMTP id VAA31607\n\tfor &lt;JuegosAR@...&gt;; Sat, 15 Mar 2003 21:49:52 -0400\r\nDate: Sat, 15 Mar 2003 22:53:32 -0300\r\nTo: JuegosAR@...\r\nSubject: Re: [ADVA] No tenemos porque hacer las cosas como la competencia.\r\nMessage-Id: &lt;20030315225332.4638d19d.coding@...&gt;\r\nIn-Reply-To: &lt;HKEHLGNGAFMBJHMJGANLAEPOCDAA.mugre25@...&gt;\r\nReferences: &lt;000b01c2eb4d$9f172ae0$53b228c8@fdsp&gt;\n\t&lt;HKEHLGNGAFMBJHMJGANLAEPOCDAA.mugre25@...&gt;\r\nOrganization: Codenix\r\nX-Mailer: Sylpheed version 0.8.10 (GTK+ 1.2.10; i386-debian-linux-gnu)\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Juan Linietsky &lt;coding@...&gt;\r\nX-Yahoo-Group-Post: member; u=63432839\r\n\r\nOn Sat, 15 Mar 2003 21:55:40 -0300\n&quot;Luis Recagno&quot; &lt;mugre25@...&gt; wrote:\n\n&gt; Es decir que si en ukrania por consultoria ganan 5 dolares la hora.......y\n&gt; les sigue siendo negocio, probablemente un programador bajo rel de\n&gt; dependencia gane 2 0 3 dolares la hora ..........Hagamos calculos 16 dolares\n&gt; por dia 80 dilares por semana.........320 dolares por mes, o bien 24 dolares\n&gt; por dia 120 por semana o bien 480 dolares por mes.\n&gt; \n\nHay factores con los que no cuentan sobre el desarrollo de juegos en el pais,\nprincipalmente la experiencia.  Aca NADIE hizo un engine 3D desde 0, que\nintente aprovechar al maximo a las computadoras actuales tanto en uso\nde CPU como GPU. A simple vista, como poner un par de poligonos\ntexturados en la pantalla es una huevada, es tipico de un programador\npensar que puede hacer el Quake 3... \n\nAsi que si uno es un programador sano, se va a poner a diseniar primero antes\nde programar. Y no me refiero a las boludeces que te ensenian en la\nfacultad (UML / DC / DF / DFD / DER / TER / etc) sino a pensar cuales\nvan a ser todos los componentes de su juego, o sea la funcionalidad,\ncomo van a interactuar, a mucho mas alto nivel que lo antes mencionado,\nmanteniendo al mismo nivel de abstraccion el game design con el code\ndesign. \n\nIn short, A esta altura no te tenes que preocupar de que color va\na ser tu rocket launcher o si va a tirar granadas y como,\no si le vas a poder cambiar la ropa a tu avatar y ponerle bombacha o no,\nasi como tampoco te tenes que preocupar en como vas a optimizar\nel culling en tu render pipeline, como vas a implementar tu networking thread,\no si vas a usar png, jpg o tga para las imagenes. Esas desiciones \nes mejor dejarlas para mas adelante.\n\nAhi ya vas empezando a ver que lo que tenias pensado no es tan facil\nde hacer, despues si queres hace todos los diagramas a mas bajo nivel\nque quieras (en general excepto el DER para DBs, personalmente no encuentro\nninguno muy util). Despues tenes que ponerte a pensar cuales son las\nLIMITACIONES de tu entorno, desde el tiempo que tenes hasta el\nhardware que pensas usar, y diseniar como vas a sacar el maximo provecho\nde eso, pensando algoritmos/tecnicas o bien investigando.\n\n\nRecien AHI podes empezar a codear, les digo que por experiencia si bien vieron\nregnum online, tan solo el DISENIO de ese engine tomo facilmente DOS ANIOS,\ny probablemente la programacion no tome mas de uno. Noches enteras\nde quedarnos discutiendo entre los programadores sobre como ibamos a implementar\ntal o cual cosa permitio que a la hora de programar, surja el minimo de inconvenientes,\ny en esa etapa no gastamos un mango, asi que es guita ahorrada.\n\nAHORA, tengan en cuenta que los juegos comercialeles AAA del primer mundo \ngastan muchisimo menos tiempo en disenio y mas en implementacion, que quiere decir eso?\nQue toman una de las siguientes opciones:\n1- Compran un motor ya hecho que se ajuste lo mas posible a sus necesidades\n2- Se preparan a gastar 3 anios en el desarrollo de un juego, donde el disenio se va haciendo\nsobre la marcha. Esto pasa por dos razones, en principio porque los $hareholder$ quieren ver\nque todo funciona, y si no ven una minita tirando hechizos en medio de un templo a los pocos\nmeses, simplemente van a pensar que no se esta trabajando, o no se trabaja bien. Y en un segundo\npunto, porque los programadores simplemente son empleados, y a ellos les chupa un huevo si su\nproyecto sale en 1 o 3 anios,  porque a ellos les pagan por mes y listo, y hasta la compania\npuede quebrar y a lo sumo (fuera de cualquier bono, que siempre hay) solo perdieron el laburo, no guita.\nAsi que van haciendo el disenio sobre lo visual, y pierden el tiempo reescribiendo cantidades\nenormes de codigo solo para satisfacer a sus $hareholder$. El codigo final en general\nes poco reusable porque se termina adaptando a las necesidades.\n3-Deciden poner la prioridad en el disenio de un engine, para con el cual pueden ganar dinero\nhaciendo varios juegos, o simplemente licensiandolo a los que toman la opcion 1- :)\n\nTanto 2 como 3 requieren mucho tiempo, porque el disenio empieza cuando empieza el proyecto,\ny ademas ese tiempo de hacer solo programacion eyecandy y diseniar se paga. \n1 y 2 requieren especial atencion ya que el laburo es adaptar el code design al game design,\nque en general pasa que ya esta hecho antes de que se empiece a programar.\n\nAhora volviendo al tercer mundo, nosotros no podemos hacer ni 1, ni 2 ni 3. porque no hay guita,\nasi de simple. asi que mi recomendacion personal a toda la gente de la ADVA, programadores\no no, si es que quieren lograr un juego que se parezca mas a algo AAA, que al tipico juego\namateur de navecitas o chabon que dispara..  es que traten de pasar por la etapa de disenio \nsin gastar un mango,  pueden diseniar y investigar en cualquier momento libre, pensar\nen como solucionar problemas, como crear funcionalidad, etc... y tratar de llevar ese proyecto \ngrande con el que tanto suenian a papel.  Pero no a nivel de un design document de gameplay,\no algo por el estilo sino a un code design document (como van a hacer el programa).\nEl disenio del juego es importante, pero tienen que entender que no tienen tiempo\nde hacer code design para game design, asi que traten de pensar como pueden integrar\nel game design con el code design de la manera mas optima, asi ahorran tiempo\ny dinero. \n\nEvidentemente se sobreentiende que no me refiero a hacer un desarrollo triple A encargado\ndesde afuera, sino a un proyecto encarado desde adentro. Estoy convencido que es imposible\nque se encargue este tipo de desarrollos a cualquier empresa de este pais, simplemente\npor el hecho de que nadie puede demostrar lo que puede hacer, ni tiene publicado trabajo\nprevio al nivel que un publisher de afuera necesita ver.\n\nSi piensan en todo el tiempo que se ahorran laburando de esta manera, y si entienden\nque estan dispuestos a hacer este trabajo para ustedes con el objetivo de luego\nconseguir un publisher extranjero con algo mostrable o al menos en un 80% del desarrollo,\nvan a ver que los costos empiezan ser mucho mas afrontables y reales, aunque siga \nsiendo una apuesta arriesgada.\n\nEso si, necesitan trabajar en equipo y elegir muy bien con quien van a trabajar,\ntiene que ser gente de lo mas capacitada y talentosa, tanto desde el punto\nde programacion, como desde el punto de vista comercial o artistico(si, solo con programadores\nno alcanza) Y no digo que no alcanze porque un programador no pueda ser buen\ncomerciante (o artista, o game designer o lo que sea , el viejo dicho de cada cual\na lo suyo) porque eso lisa y llanamente es mentira. No alcanza porque uno NECESITA\ntener gente DEDICADA a esas areas. Alguien que se encargue todo el dia de hacer research, manejar\ncontactos, horarios, reuniones, etc Asi como alguien dedicado todo el dia al arte, o \na la programacion, o en algunos casos hasta el diseino y la coordinacion del \nproyecto (cuando ya es mucha gente). Es asi, si quieren dedicarse a lo comercial, sepan\nque van a tener mucho menos tiempo de programar, y lo mismo para todo lo demas\ncon todo lo demas. \n\nAsi que gentlemen, ponganse las pilas. Usen el sentido comun en vez\nde tratar de hacer los desarrollos &quot;a lo primer mundo&quot;. Alla en yanquilandia\nles brota el dinero de las orejas, y hasta un empleado de mcdonalds o un \npintor ganan mas que nosotros, pero al mismo tiempo estan encerrados\nen su pragmatismo y en el american way.\n\n\nSaludos!\n\nJuan linietsky.\n\n"}}