{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"POLL","capabilities":[{"name":"READ"},{"name":"VOTE"},{"name":"CREATE"}]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"READ"},{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"ar.groups.yahoo.com","intlCode":"ar"},"comscore":"pageview_candidate","ygData":{"userId":0,"authorName":"Juan Linietsky","from":"Juan Linietsky &lt;coding@...&gt;","replyTo":"LIST","senderId":"yu4VlP0WAV-lfmkr5mWW6ec1Xb91LMB-1kHxVgm_G-jOvGLcSiVRh9C2a6XwiiDV2fXyISG4EIqnrvLL-PL644R148yBT0Mi0dZY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re[4]: [JuegosAR] Linietsky","postDate":"985718485","msgId":836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDMyNzE1NDEyNTAzLjA1Nzg4QHNlcnZlcj4=","inReplyToHeader":"PDIwMDEwMzI3MDg0NzI4LkUxMDM4M0BnYWlhPg==","referencesHeader":"PDAwZTgwMWMwYjZkNyQ3N2RkNGU3MCQ3NDAwYThjMEB3ZWJtYXJrZXRzLmNvbS5hcj4gPDIwMDEwMzI3MDg0NzI4LkUxMDM4M0BnYWlhPg=="},"prevInTopic":834,"nextInTopic":837,"prevInTime":835,"nextInTime":837,"topicId":741,"numMessagesInTopic":62,"msgSnippet":"... no es _tan_ sencillo, pero en base.. si, es asi. No todos son posix, y no todos usan exactamente las mismas librerias/compiladores/etc, pero por suerte","rawEmail":"Return-Path: &lt;coding@...&gt;\r\nX-Sender: coding@...\r\nX-Apparently-To: JuegosAR@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 27 Mar 2001 18:43:22 -0000\r\nReceived: (qmail 6073 invoked from network); 27 Mar 2001 18:43:21 -0000\r\nReceived: from unknown (10.1.10.26) by l10.egroups.com with QMQP; 27 Mar 2001 18:43:21 -0000\r\nReceived: from unknown (HELO john.anime.com.ar) (199.190.101.216) by mta1 with SMTP; 27 Mar 2001 18:43:17 -0000\r\nReceived: from server (red@... [24.232.17.22]) by john.anime.com.ar (8.9.3/8.9.3) with SMTP id OAA31793 for &lt;JuegosAR@yahoogroups.com&gt;; Tue, 27 Mar 2001 14:42:12 -0400\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nTo: JuegosAR@yahoogroups.com\r\nSubject: Re: Re[4]: [JuegosAR] Linietsky\r\nDate: Tue, 27 Mar 2001 15:41:25 -0300\r\nX-Mailer: KMail [version 1.2]\r\nReferences: &lt;00e801c0b6d7$77dd4e70$7400a8c0@...&gt; &lt;20010327084728.E10383@gaia&gt;\r\nIn-Reply-To: &lt;20010327084728.E10383@gaia&gt;\r\nOrganization: CL\r\nMIME-Version: 1.0\r\nMessage-Id: &lt;01032715412503.05788@server&gt;\r\nContent-Transfer-Encoding: 8bit\r\nFrom: Juan Linietsky &lt;coding@...&gt;\r\n\r\nOn Tuesday 27 March 2001 08:47, you wrote:\n&gt; Perdon,\n&gt;\n&gt; pero hace mucho que no escribo a la lista pero este tema me interesa y\n&gt; mucho.\n&gt;\n&gt; Me gustaria decir las ventajas y las desventajas de un SO como Linux.\n&gt;\n&gt; Ventajas:\n&gt;\n&gt; 1- Es abierto: Cualquier duda o pregunta sobre el SO se contesta. No hay\n&gt; parte del SO que no este documentada.\n&gt; 2- El precio: Es gratuito, que mas?\n&gt; 3- Es UNIX: Un SO unix implica que pasar de un UNIX a otro es muy facil.\n&gt; Por ejemplo pueden programar para linux y luego pasar el juego a IRIX,\n&gt; Solaris, True64, etc...\n\nno es _tan_ sencillo, pero en base.. si, es asi. No todos son posix, y\nno todos usan exactamente las mismas librerias/compiladores/etc, pero\npor suerte estan los gnutools en todos ellos.\n\n&gt; 4- Estabilidad: La estabilidad a la que me refiero es si se cuelga o no. El\n&gt; hecho es que Linux se cuelga, como cualquier otro SO. El detalle esta en\n&gt; que existe versiones del kernel mucho mas estables que otros y esta\n&gt; estabilidad es comparable con sistemas Solaris o True64.\n\nLinux no &quot;se cuelga&quot; a menos que te pongas a hacer taradeces\no jodas con el hardware, desde userland colgarlo es directamente\ncasi imposible, podes tener problemas con la placa de \nvideo/sonido/interrupciones no handleadas o quedarte sin memoria. Te lo digo \nporque hace 3 anios que tengo linux y nunca jamas se colgo &quot;de la nada&quot; (como \nsuele pasar demasiado seguido con windows), pero si probando modulos en \ndevelopment o con fallas feas de hardware. ahh.. y es &quot;Tru64&quot; no &quot;True64&quot;,\nex digital unix, (compaq lo compro).\n\n\n&gt; 5- Supervivencia del mas apto: Las aplicaciones de Linux tienen una\n&gt; caracteristica que no se ve hace mucho en la era de la computacion: son\n&gt; muchas, se crea una cada dia, y desaparecen una el mismdo dia. Tienden a\n&gt; sobrevivir los que mejor funcionan y lo que mas futuro tiene. No es una\n&gt; cuestion de mercado, sino de gusto y calidad. Uno puede encontrar una\n&gt; aplicacion muy basura un dia, pero llegara a ser una gran aplicacion algun\n&gt; dia. Ejemplo? Gimp, Gnome, KDE, StarOffice...\n&gt;\n\ngnome es la ridiculez maxima, la modularizacion llevada muchisimo mas alla de \nlo necesario, y gtk es una mierda, te lo dice alguien que programa hace mas \nde un anio en esa porqueria, pero esa es mi opinionz ;). El Gimp rulea. y el \nStarOffice recien hace poco es GPL... y es viejisimo.\n\n\n&gt; Desventaja:\n&gt;\n&gt; 1- Es abierto: Cualquiera puede tocar el codigo. Con esto quiero asentar\n&gt; algo muy importante: NO SEAN TARADOS, NO TOQUEN EL CODIGO PORQUE SI, PORQUE\n&gt; QUIEREN QUE SEA MAS RAPIDO. Tengan en cuenta que es un sistema operativo\n&gt; multitarea y que tiene que cumplir muchos requisitos para que lo sea. No se\n&gt; metan donde nadie los llame. Y si creen que estan haciendo algo bueno por\n&gt; el SO, por favor avisen a www.kernel.org asi pueden revisar lo que hicieron\n&gt; y desidir si queda o no en el kernel para futuras versiones. Es una buena\n&gt; manera de que Linux sea y se mantenga como un SO estable.\n\nMientras es cierto que al ser opensource, uno puede lograr que el codigo vaya\nmas rapido por su propia cuenta, esto no se debe a que agarras el codigo asi \nnomas, lo lees de un saque, magicamente lo entendes y lo mejoras\npara que vaya mas rapido. Lo que si es muy usual es que hay gente\nque compila todo usando pgcc (una version del gcc con optimizaciones \nespeciales para pentiums)\n\n&gt; 2- El precio: Quien no ha desconfiado por una remera de 5$ que se vende en\n&gt; once? Los que no lo conocen no pueden creer todas las ventajas. Para que la\n&gt; gente (no nosotros, los otros) de que Linux es bueno y amigable tiene que\n&gt; venir Bill Gates a decirlo.\n\nEso ya paso, ya no es un producto salido de quien sabe donde.\n\n&gt; 3- Es UNIX: Olvidensen de la amistad en los sistemas UNIX. Ni el mas\n&gt; amigable como el IRIX es amigable. Todos tienen sus historias, sus\n&gt; problemas y su psicologo que los ayuda con sus traumas (Las empresas que\n&gt; los venden). Los problemas mas conocidos son, especificamente en el mundo\n&gt; de los juegos: instalacion (que carajo es un filesystem?), la seguridad\n&gt; (quien mierda es root?), el entorno (pero esto se parece a DOS, es una\n&gt; mierda!!!), y el X (Como, que mierda es esto? Se parece a Windows pero no\n&gt; lo es?)\n\nBueno, una cosa es la abuelita que usa la computadora para mandar emails\na sus amigas, que si le pones algo como linux se horroriza hasta el infarto,\ny otra alguien como nosotros que tiene al menos una minima idea de que\nes un archivo, un directorio, etc.\n\n&gt; 5- Supervivencia: A lo que dije antes solo le falta un detalle, nadie\n&gt; conoce el futuro, asi que no esperen que empiezen a programar en una\n&gt; libreria que seguira con futuro y que podran hacer miles de versiones de su\n&gt; juego en la misma. Al fin y al cabo un dia morira porque alguna otra\n&gt; libreria sobrevivira para eliminarla.\n\nuh.. quien se murio? que librerias se murieron y se dejaron de usar?\nestas hablando de cosas viejas como xaw/motiff/athena/tk/xforms/etc?\no de gtk/gnome/qt/kde ? Hagas lo que hagas las librerias no van a desaparecer\ndel planeta como si nada. \n\n&gt; Y para terminar quiero que los que programen en linux tengan en cuenta, que\n&gt; son problemas tipicos con los que me cruce:\n&gt;\n&gt; 1- Sincronizacion: El sonido y el video son MUY dificiles de sincronizar.\n&gt; Es el hecho de que es un SO multitarea, y aunque programen en un mismo\n&gt; thread, algun proceso en el medio va a ser lo suficientemente hijo de puta\n&gt; para cagarnos nuestra preciosa animacion. \n\ncreo que estas equivocado, no se de donde sacaste tal cosa. Sincronizar\nambas cosas es extremadamente pelotudo, te lo digo yo que programe con\nOSS/Alsa, la latencia es increiblmente baja y OSS funciona a manera de FIFO,\ncosa que nos hace la vida mucho mas facil que tener que joder con\nlos DirectSoundBufferPositionNotify y los UpdateHandles\nEl unico problema que tiene linux es que la latencia se caga hasta ~400ms \ncuando hay uso _MUY_ intensivo de disco.. cosa que en un juego\nno te jode mucho. A mi me jode porque programe sequenciadores midi\ny softsynths para linux, y te jode mucho en el punto de hacer disk dumping\nde un track. Igualmente si queres solucionar este problema te podes\nbajar los low latency patches de ingo molnar y asunto arreglado.\n\n\n&gt; La solucion seria tener niveles\n&gt; de root... pero si son buenos programadores sabran que eso es una CHANCHADA!\n\ndepende de lo que haces\n\n&gt; 2- Video: Por desgracia no hay una libreria que nos salve la vida. \n\ny SDL no existe no? en que anio vivis?\n\n&gt; Con lo\n&gt; que si quieren hacer algo bueno y que perdure, olvidenlo. Lo que si parece\n&gt;  tener futuro es OpenGL (Mesa), \n\nMesa en si esta muerto, era principalmente una implementacion de software \nrender de opengl, ahora que ya hay excelente soporte de OpenGL por hardware\npara linux es innecesario. Lo unico que queda de mesa que es realmente util \nes la implementacion GLUT freeware.\n\n&gt; pero es piola solo para 3D porque 2D es\n&gt; mejor usar directamente las funciones de X. \n\nUsar las funciones de X con que sentido? Ya hay librerias que te dan la \nfuncionaliad de lo que quieras, meterse directmanete con X es\nmasoquismo.\n\n&gt; Para cosas piolas pero sin\n&gt; mucho futuro, he visto que el Alegro es una gran opcion. \n\nAllegro NO es una gran opcion. Fue pensado originalmente para DOS, y por mas\nque hay muchos puertos para varias plataformas, no es ni sera ni fue su \nobjetivo original. Ademas de que allegro intenta tomar el control de la \nmaquina bajo linux. Para este tipo de cosas SDL es la mejor opcion para\ncualquier plataforma.\n\n&gt; Igual si quieren\n&gt; experimentar las librerias que existen actualmente y que son especies de\n&gt; DirectX son:\n&gt;\n&gt;                                                     SDL\n&gt; http://www.devolution.com/~slouken/SDL\n\nDefinitivamente la mejor opcion, tanto para desarrollar en linux ( u otro \nunix) como para windows/mac y otras cosas.\n\n&gt;                                                     GGI\n&gt; http://www.ggi-project.org/\n\nggi en realidad no existe ya... SDL se lo comio\n\n&gt;                                                     Svgalib\n&gt; http://www.svgalib.org/\n\nSVGALIB ya no se usa mas. fue. no existe. es terriblemente incompatible y \npeligroso, antes de que haya X para linux era lo que se usaba para display.\n\n&gt;                                                     Xlib\n&gt; http://www.xfree86.org/\n\nXlib es programar nativamente en X, y es masoquismo.\n\n&gt;                                                     Xshm\n&gt; http://www.xfree86.org/\n\nXSHM son las X Shared Memory extensions. Es definitivamente\nuna _muy_ mala idea usar esto, y los drivers nuevos no lo soportan.\n\n&gt;                                                     Dga\n&gt; http://www.xfree86.org/\n&gt;\n\nDGA fue un especie de fix temporario a las limitaciones de Xfree v.3, \nnecesitas\nque tu programa sea ROOT o SUID root para usarlo. Ademas de que es una \ncompleta perdida de tiempo porque nunca se aconsejo el uso.\n\nLo que se viene ahora para X, que vendria a ser lo definitivo, es XV,\nque si realmente queres tener acceso a video a muy buena velocidad\na modo nativo de X, es la mejor opcion.\n\n&gt; Por lo que lei: Dga es una muy buena opcion.\n&gt;\n\nNo, DGA no existe, enserio.\n\n&gt; Para los que conocen lo que es realmente X, olviense de jugar desde un\n&gt; servidor en maquina distinta de un cliente. Eso es una estupides, excepto\n&gt; que usen GLX que funciona muy bien.\n&gt;\n\nxhostear un juego? es es medio dificil, mejor dicho imposible.\nGLX funciona si, pero te estas olvidando que no se &quot;programa&quot;\npara glx, es un network transport layer para opengl.\n\n&gt; 3- Sonido: Hay servidores para mezclar sonidos. Vean algo de eso buscando\n&gt; la palabra eSound en alguna pagina de Linux.\n&gt;\n\nSi no sabes mezclar sonidos por vos mismo entonces no te podes\nconsiderar un programador. eSound (enlightenment sound daemon)\nfue pensado como un &quot;servidor&quot; de sonido para aplicaciones\ny/o placas que no soportan mas de un file descriptor a /dev/dsp\nHoy en dia tenes eSound (gnome) y ArtsD (kde) pero\nlo mejor es y sera usar /dev/dsp, o el soporte de sonido de SDL_mixer\nque es extremadamente bueno.\n\n\n&gt; Espero que esto despeje alguna duda de lo que linux y no se confundan,\n&gt; ustedes estan aqui para programar un juego, no para jugar a cual es el SO\n&gt; mas estable. \n\nPerdona, mi intencion no es ser agresivo, sino evitar que confundas vos\na la gente que no tiene idea de lo que es el sistema operativo, hablas\ncomo si supieras bien del tema pero evidentemente parece que\nhay algunas cosas que el que esta un poco confundido sos vos,\npor eso mi respuesta, nomas para esclarecer estos temas a vos y a los que\nhayan leido tu mail anterior.\n\n\n&gt; Y les puedo asegurar que los chistes Windows 9x son una\n&gt; verdadera obra de arte para eso. Linux... si quieren complicarse la vida...\n&gt; Soy fanatico de Linux, pero no soy ningun estupido, que quede claro mi\n&gt; punto.\n&gt;\n\nsi, quedo claro :)\n\n\n&gt; Saludos\n&gt; Cristian.\n&gt;\n\n\n\n-- \nJuan Linietsky/Codelarvs\nhttp://www.codelarvs.com.ar\n\n"}}